{
  "id": 2574,
  "name": "Treetop Retriever",
  "description": "They made the ultimate sacrifice.",
  "requirement": "Locate the 10 lost Priory corpses in the Tarnished Treetop of Auric Basin.",
  "locked_text": "",
  "type": "Default",
  "flags": [
    "Permanent"
  ],
  "bits": [
    {
      "type": "Text",
      "text": "A female asura researcher was last seen north of Wanderer\u0027s Waypoint."
    },
    {
      "type": "Text",
      "text": "Since he went to an upper ledge to examine the Exalted portal, the asura researcher hasn\u0027t been heard from."
    },
    {
      "type": "Text",
      "text": "Someone overheard the Zintl boasting about finding the remains of a female charr explorer."
    },
    {
      "type": "Text",
      "text": "Echoes of a male charr explorer fighting a large colony of vampire beasts filled the canopy the other night."
    },
    {
      "type": "Text",
      "text": "A human explorer bailed from the airship too early. She was lost near Capitzel Grounds."
    },
    {
      "type": "Text",
      "text": "Heading east, the explorer was cornered by a jaguar. The human never made it down from the canopy."
    },
    {
      "type": "Text",
      "text": "An injured norn historian held off the bonebreaker so others could escape. Her sacrifice won\u0027t be forgotten."
    },
    {
      "type": "Text",
      "text": "A lower ledge broke his fall, but then the norn explorer was surrounded by Tengu scouts."
    },
    {
      "type": "Text",
      "text": "A sylvari historian got trapped along the northern cliffside of Tarnished Treetop. She had little chance to survive."
    },
    {
      "type": "Text",
      "text": "An explorer tried to find his way south and down from the canopy. The sylvari only found a Coztic ambush."
    }
  ],
  "tiers": [
    {
      "count": 1,
      "points": 1
    },
    {
      "count": 2,
      "points": 1
    },
    {
      "count": 3,
      "points": 1
    },
    {
      "count": 4,
      "points": 1
    },
    {
      "count": 5,
      "points": 1
    },
    {
      "count": 6,
      "points": 1
    },
    {
      "count": 7,
      "points": 1
    },
    {
      "count": 8,
      "points": 1
    },
    {
      "count": 9,
      "points": 1
    },
    {
      "count": 10,
      "points": 1
    }
  ]
}