{
  "id": 2602,
  "name": "No Mask Left Behind",
  "description": "Collect the masks of fallen Exalted throughout Auric Basin.",
  "requirement": "Locate and collect all of the Exalted masks left behind by vinetooths in Auric Basin.",
  "locked_text": "Can you find all the Exalted masks throughout the basin?",
  "type": "Default",
  "flags": [
    "Permanent"
  ],
  "bits": [
    {
      "type": "Text",
      "text": "Northwatch Descent: Deep underground below the outpost."
    },
    {
      "type": "Text",
      "text": "Bristleback Chasm: Somewhere up high in Vinetooth\u0027s Den."
    },
    {
      "type": "Text",
      "text": "Eastwatch Bluff: Overlooking an Eastwatch pylon where an Exalted sage is pulled from his duties."
    },
    {
      "type": "Text",
      "text": "Griffonfall: Hidden at the bottom of a secret waterfall."
    },
    {
      "type": "Text",
      "text": "Chak Hollow: Overlooking a razed Nuhoch village."
    },
    {
      "type": "Text",
      "text": "Morwood Wilds: Behind the vine wall, but be aware that timing is everything!"
    },
    {
      "type": "Text",
      "text": "Bristleback Chasm: Across the falls, stuck on a tree."
    },
    {
      "type": "Text",
      "text": "Eastwatch Bluff: Look behind the various waterfalls."
    },
    {
      "type": "Text",
      "text": "The Falls: Check every southern-side tree branch leading down to the falls."
    },
    {
      "type": "Text",
      "text": "The Falls: Somewhere behind the expansive wall of water."
    },
    {
      "type": "Text",
      "text": "Westwatch Patch: Within the upper walls of the golden ooze cavern."
    },
    {
      "type": "Text",
      "text": "Tarnished Treetop: Look on the southern-canopy tree branches for this mask."
    },
    {
      "type": "Text",
      "text": "Northwatch Descent: On a southwestern ledge with an amazing view of the outpost."
    },
    {
      "type": "Text",
      "text": "Maguuma Shallows: On an upper perch near where creatures grow big."
    },
    {
      "type": "Text",
      "text": "Burnisher Quarry: Within the waters at the top of the waterfall."
    },
    {
      "type": "Text",
      "text": "Mossheart Walk: Within a small cave opposite wyvern\u0027s pylon."
    },
    {
      "type": "Text",
      "text": "Chak Hollow: Located within a southern alcove with a good view to the entrance of Tangled Depths."
    },
    {
      "type": "Text",
      "text": "Morwood Wilds: In the sky overlooking one of the blighted saplings."
    },
    {
      "type": "Text",
      "text": "Balthazar\u0027s Rest: On a rock with a clear view of the temple door."
    },
    {
      "type": "Text",
      "text": "Southwatch Creep: Look behind the northwestern wall that faces the outpost itself."
    },
    {
      "type": "Text",
      "text": "Southwatch Creep: Look to the east by the top of the Tarir entrance."
    },
    {
      "type": "Text",
      "text": "Southwatch Creep: Check the top roots when heading east on your way to the crash site."
    },
    {
      "type": "Text",
      "text": "Tarnished Treetop: Keep an eye out on the lower canopy near fungi royalty."
    },
    {
      "type": "Text",
      "text": "Lastgear Standing: On the outskirts of the cave entrance."
    },
    {
      "type": "Text",
      "text": "Arrowhead Vale: Overlooking the northern entrance to Tarir."
    }
  ],
  "tiers": [
    {
      "count": 1,
      "points": 1
    },
    {
      "count": 2,
      "points": 1
    },
    {
      "count": 3,
      "points": 1
    },
    {
      "count": 4,
      "points": 1
    },
    {
      "count": 5,
      "points": 1
    },
    {
      "count": 6,
      "points": 1
    },
    {
      "count": 7,
      "points": 1
    },
    {
      "count": 8,
      "points": 1
    },
    {
      "count": 9,
      "points": 1
    },
    {
      "count": 10,
      "points": 1
    },
    {
      "count": 11,
      "points": 1
    },
    {
      "count": 12,
      "points": 1
    },
    {
      "count": 13,
      "points": 1
    },
    {
      "count": 14,
      "points": 1
    },
    {
      "count": 15,
      "points": 1
    },
    {
      "count": 16,
      "points": 1
    },
    {
      "count": 17,
      "points": 1
    },
    {
      "count": 18,
      "points": 1
    },
    {
      "count": 19,
      "points": 1
    },
    {
      "count": 20,
      "points": 1
    },
    {
      "count": 21,
      "points": 1
    },
    {
      "count": 22,
      "points": 1
    },
    {
      "count": 23,
      "points": 1
    },
    {
      "count": 24,
      "points": 1
    },
    {
      "count": 25,
      "points": 1
    }
  ],
  "rewards": [
    {
      "type": "Item",
      "id": 73798,
      "count": 1
    }
  ]
}