{
  "id": 3440,
  "name": "Rock Collector",
  "description": "Taimi\u0027s research might benefit from these.",
  "requirement": "Collect all the stray firestone shards.",
  "locked_text": "",
  "type": "Default",
  "flags": [
    "Permanent"
  ],
  "bits": [
    {
      "type": "Text",
      "text": "Savage Rise: In a cave behind the Rolling Devil nest."
    },
    {
      "type": "Text",
      "text": "Titan\u0027s Throat: Underneath and to the east of the gate of fire."
    },
    {
      "type": "Text",
      "text": "Heathen\u0027s Hold: High above Prisoner\u0027s Perch, near a Mastery Insight."
    },
    {
      "type": "Text",
      "text": "Heathen\u0027s Hold: Atop a plateau above Iota Vault."
    },
    {
      "type": "Text",
      "text": "Scalding Gorge: On a ledge high above, north of Sandstone Archway."
    },
    {
      "type": "Text",
      "text": "Scalding Gorge: On a ledge high above, west by northwest of Sandstone Archway."
    },
    {
      "type": "Text",
      "text": "Scalding Gorge: On a ledge high above, northwest of Sandstone Archway."
    },
    {
      "type": "Text",
      "text": "Rata Arcanum: In a high nook, east of Seething Pillar."
    },
    {
      "type": "Text",
      "text": "Titan\u0027s Throat: On the northeastern side, just below the gate of fire."
    },
    {
      "type": "Text",
      "text": "Titan\u0027s Throat: On the northeastern side, a little lower below the gate of fire."
    },
    {
      "type": "Text",
      "text": "Heathen\u0027s Hold: Below the lava river, on the west side."
    },
    {
      "type": "Text",
      "text": "Scalding Gorge: Atop a tall stone outcropping, southeast of Sandstone Archway."
    },
    {
      "type": "Text",
      "text": "Scalding Gorge: Hidden below Sandstone Archway, on the eastern side."
    },
    {
      "type": "Text",
      "text": "Scalding Gorge: On the underside of Sandstone Archway."
    },
    {
      "type": "Text",
      "text": "Rata Arcanum: Underneath a large firestone spire."
    },
    {
      "type": "Text",
      "text": "Wind Rider Ledge: In a ceiling cave below Rata Arcanum."
    },
    {
      "type": "Text",
      "text": "Wind Rider Ledge: Near the ceiling along the western wall."
    },
    {
      "type": "Text",
      "text": "Wind Rider Ledge: On the northern side, in a ceiling crevasse."
    },
    {
      "type": "Text",
      "text": "Wind Rider Ledge: High along the wall, southwest of Seething Pillar."
    },
    {
      "type": "Text",
      "text": "Wind Rider Ledge: Embedded high in a large palm tree."
    },
    {
      "type": "Text",
      "text": "Mariner Landing: In a nook high along the western wall."
    },
    {
      "type": "Text",
      "text": "Western Boiling Sea: On the underside of Wind Rider Ledge."
    },
    {
      "type": "Text",
      "text": "Western Boiling Sea: On the side of the foot of Wind Rider Ledge."
    },
    {
      "type": "Text",
      "text": "Mariner Landing: In plain view near Sub Landing."
    },
    {
      "type": "Text",
      "text": "Western Boiling Sea: Just below the Mastery Insight."
    },
    {
      "type": "Text",
      "text": "Western Boiling Sea: Along a ledge northwest of Seething Pillar."
    },
    {
      "type": "Text",
      "text": "Western Boiling Sea: On a stone outcropping east of Seething Pillar."
    },
    {
      "type": "Text",
      "text": "Eastern Boiling Sea: On an island northwest of Frothing Pedestal."
    },
    {
      "type": "Text",
      "text": "Eastern Boiling Sea: On the ceiling of a cave along the northern wall."
    },
    {
      "type": "Text",
      "text": "Ancient Hollow: Deep in a shallow cave southeast of the golem graveyard."
    },
    {
      "type": "Text",
      "text": "Ancient Hollow: In a nook in a wall, north of a mushroom village."
    },
    {
      "type": "Text",
      "text": "Savage Rise: At the source of the waterfall at Peace Grounds."
    },
    {
      "type": "Text",
      "text": "Golemancer\u0027s Tomb: In a cave outside the tomb, high above Scout\u0027s Clearing."
    },
    {
      "type": "Text",
      "text": "Golemancer\u0027s Tomb: Embedded in the wall outside the tomb, high above Scout\u0027s Clearing."
    },
    {
      "type": "Text",
      "text": "Rata Arcanum: In the upper area, atop a small spire."
    },
    {
      "type": "Text",
      "text": "Rata Arcanum: In a nook behind the Inquest\u0027s captive druid."
    },
    {
      "type": "Text",
      "text": "Rata Arcanum: Overlooking the Inquest\u0027s portal."
    },
    {
      "type": "Text",
      "text": "Wind Rider Ledge: In a cranny above the northern tip of the ledge."
    },
    {
      "type": "Text",
      "text": "Rata Arcanum: In a nook near some soil in the caves behind Rata Arcanum."
    },
    {
      "type": "Text",
      "text": "Heathen\u0027s Hold: In a mercenary\u0027s bucket."
    },
    {
      "type": "Text",
      "text": "Golemancer\u0027s Tomb: At the tip of a long, thin outcropping outside the southern entrance to the tomb."
    },
    {
      "type": "Text",
      "text": "Savage Rise: In a cranny within the bristleback\u0027s nest."
    },
    {
      "type": "Text",
      "text": "Heathen\u0027s Hold: Within a crevasse in Iota Vault."
    },
    {
      "type": "Text",
      "text": "Heathen\u0027s Hold: Above the entrance to Iota Vault."
    },
    {
      "type": "Text",
      "text": "Heathen\u0027s Hold: In the rocks on the wall north of Iota Vault."
    },
    {
      "type": "Text",
      "text": "Savage Rise: A cave in the ceiling below Heathen\u0027s Hold waypoint."
    },
    {
      "type": "Text",
      "text": "Scalding Gorge: In a slit in the rocks looking north from atop the northwestern arch."
    },
    {
      "type": "Text",
      "text": "Heathen\u0027s Hold: Under the grating."
    },
    {
      "type": "Text",
      "text": "Golemancer\u0027s Tomb: In a crack in the ceiling, in the room across from the champion devourer. Bring an Oakheart\u0027s essence."
    },
    {
      "type": "Text",
      "text": "Rata Arcanum: A crack in the ceiling in the caves behind Rata Arcanum."
    },
    {
      "type": "Text",
      "text": "Savage Rise: Underneath an outcropping north of Scout\u0027s Clearing."
    },
    {
      "type": "Text",
      "text": "Heathen\u0027s Hold: Beneath a massive defense turret, on the east shore of the lava river."
    },
    {
      "type": "Text",
      "text": "Savage Rise: Near the base of a massive rocky pillar, southwest of the Peace Grounds."
    },
    {
      "type": "Text",
      "text": "Rata Arcanum: On a rock wall, just outside the entrance to the Inquest Field Lab."
    },
    {
      "type": "Text",
      "text": "Ancient Hollow: Along a path that runs northeast toward a mushroom village."
    },
    {
      "type": "Text",
      "text": "Ancient Hollow: Toward the western edge of the land mass. Fireflies make their home nearby."
    },
    {
      "type": "Text",
      "text": "Mariner Landing: On the ceiling of a dark tunnel. Reef riders stand guard outside."
    },
    {
      "type": "Text",
      "text": "Mariner Landing: Atop a diagonal cliff face. Reef riders float nearby."
    },
    {
      "type": "Text",
      "text": "Savage Rise: At the entrance to a ramp that leads to Scout\u0027s Clearing."
    },
    {
      "type": "Text",
      "text": "Mariner Landing: Near a thermal tube, south of Sub Landing."
    }
  ],
  "tiers": [
    {
      "count": 1,
      "points": 1
    },
    {
      "count": 20,
      "points": 2
    },
    {
      "count": 40,
      "points": 4
    },
    {
      "count": 60,
      "points": 8
    }
  ],
  "rewards": [
    {
      "type": "Title",
      "id": 271
    }
  ]
}