{
  "id": 6455,
  "name": "Albax, the Unlucky",
  "description": "\"Bring to me your world, for I have lost mine.\" —Albax",
  "requirement": "Bring Albax lucky items from throughout Tyria by solving his riddles.",
  "locked_text": "",
  "type": "Default",
  "flags": [
    "RequiresUnlock",
    "Permanent"
  ],
  "bits": [
    {
      "type": "Text",
      "text": "\"Brave the dead land to claim the foot of the swiftest.\" Albax pointed north, toward the Cursed Shore of Orr."
    },
    {
      "type": "Text",
      "text": "\"Find the former walker of the blasted land, and gain a symbol of new growth.\" Albax shrugged while talking of the Branded landscape of the Iron Marches."
    },
    {
      "type": "Text",
      "text": "\"In homes in pale parchment hills, find the form of an old survivor in the hands of a young one.\" Albax smiled, thinking of the rivers of Timberline Falls."
    },
    {
      "type": "Text",
      "text": "\"In lush lands wracked with waste, ask for that which glitters in their patron\u0027s gaze.\" Albax\u0027s eyes opened wide picturing the dangers of Mount Maelstrom."
    },
    {
      "type": "Text",
      "text": "\"The noble bird has been swept from solitude into the hands of chaos.\" Albax hinted at the monks of Shing Jea."
    },
    {
      "type": "Text",
      "text": "\"The porcelain feline beckons you toward service in the name of the savory.\" Albax mentioned the smell of food in New Kaineng City."
    },
    {
      "type": "Text",
      "text": "\"Bathed in gold and hubris, luck itself will lead you to me.\" Albax described a special room of games in Arborstone."
    },
    {
      "type": "Text",
      "text": "\"In the sea of green, among the scaly ones, a relic lies with the mistakes of one\u0027s past.\" Albax gestured at the Jade Sea all around him."
    },
    {
      "type": "Text",
      "text": "\"A sacred weapon is held in the boughs of great trees, never to be turned against them.\" Albax spoke of the verdant sights of the Maguuma Jungle."
    },
    {
      "type": "Text",
      "text": "\"The needy hold tight to a hope of plenty in a pitiless golden land.\" Albax cringed while thinking of the heat in the Crystal Desert."
    }
  ],
  "tiers": [
    {
      "count": 1,
      "points": 1
    },
    {
      "count": 4,
      "points": 2
    },
    {
      "count": 8,
      "points": 3
    }
  ]
}