{
  "id": 7034,
  "name": "Fantastic Flying Foxes",
  "description": "",
  "requirement": "Play with all shrine guardian infants in Amnytas at least once.",
  "locked_text": "",
  "type": "Default",
  "flags": [
    "Permanent"
  ],
  "bits": [
    {
      "type": "Text",
      "text": "Bastion of Strength: Watching the Astral Ward run up and down stairs."
    },
    {
      "type": "Text",
      "text": "Bastion of the Natural: Pretending to spy on the concocters."
    },
    {
      "type": "Text",
      "text": "Bastion of Knowledge: Loves to be lost among the books."
    },
    {
      "type": "Text",
      "text": "Bastion of the Obscure: Hiding with boxes of relics."
    },
    {
      "type": "Text",
      "text": "Bastion of Balance: Looking up toward Lyhr\u0027s quarters."
    },
    {
      "type": "Text",
      "text": "Bastion of the Natural: Playing in a garden."
    },
    {
      "type": "Text",
      "text": "Bastion of the Celestial: Napping near a shaded lagoon."
    },
    {
      "type": "Text",
      "text": "Bastion of the Natural: Sitting with the Astral Ward members."
    },
    {
      "type": "Text",
      "text": "Bastion of Balance: Playing above a medical plaza."
    },
    {
      "type": "Text",
      "text": "Bastion of Strength: Strength training with Rift Hunters."
    },
    {
      "type": "Text",
      "text": "???: Looking up at a theater."
    },
    {
      "type": "Text",
      "text": "Bastion of the Natural: Reflecting on life from afar."
    },
    {
      "type": "Text",
      "text": "Bastion of Strength: Pretending to be royalty inside a mighty tower."
    },
    {
      "type": "Text",
      "text": "???: Trying to skip rocks among the clouds."
    },
    {
      "type": "Text",
      "text": "Bastion of Knowledge: Trying to throw things at the World Spire from a wizard\u0027s tower."
    },
    {
      "type": "Text",
      "text": "Bastion of the Natural: Fell off a platform and tumbled around."
    },
    {
      "type": "Text",
      "text": "Bastion of Strength: Watches workshops and camps from up high."
    },
    {
      "type": "Text",
      "text": "Bastion of Balance: Watching a pond from afar."
    },
    {
      "type": "Text",
      "text": "Bastion of the Obscure: Hiding among the seaweed and chak."
    },
    {
      "type": "Text",
      "text": "Bastion of Knowledge: Got thrown off a ley line."
    },
    {
      "type": "Text",
      "text": "Bastion of the Celestial: Demonstrated its mastery of the terrain of Amnytas."
    },
    {
      "type": "Text",
      "text": "Bastion of the Natural: Trying to disrupt a meditation session."
    },
    {
      "type": "Text",
      "text": "???: Getting ready to fly to a park."
    },
    {
      "type": "Text",
      "text": "Bastion of the Obscure: Loves jumping on platforms."
    },
    {
      "type": "Text",
      "text": "Bastion of Strength: Racing to watch ritual performances."
    }
  ],
  "tiers": [
    {
      "count": 5,
      "points": 1
    },
    {
      "count": 10,
      "points": 1
    },
    {
      "count": 15,
      "points": 2
    },
    {
      "count": 20,
      "points": 3
    },
    {
      "count": 25,
      "points": 3
    }
  ],
  "rewards": [
    {
      "type": "Mastery",
      "region": "Unknown",
      "id": 699
    }
  ]
}