{
  "name": "Fixing the Blame",
  "level": 70,
  "story": 10,
  "goals": [
    {
      "active": "Investigate Tactician Syska\u0027s background.",
      "complete": "I looked into Tactician Syska\u0027s background, hoping to find clues about her involvement my friendly fire incident that killed Pact troops. One of the soldiers in Syska\u0027s unit said she spent a lot of time in a Black Citadel tavern, so I decided to continue my investigation there."
    },
    {
      "active": "Follow Syska\u0027s trail to the Black Citadel.",
      "complete": "Barkeep Gallowknot knew Syska as one of his regular customers. He told me about the mysterious meetings Syska routinely held in his tavern, and steered me toward a soldier named Ignavus Ridgerunner. I set out to find Ignavus and solve this mystery before any more Pact soldiers get hurt."
    },
    {
      "active": "Interrogate Ignavus Ridgerunner near Snow Ridge Camp.",
      "complete": "When I questioned Ignavus, he confessed that he and Syska had been selling Pact weaponry and supplies on the black market. The last time he saw her was at a secret meeting with the Flame Legion near Onager Bivouac, which became my next stop."
    },
    {
      "active": "Investigate the Pact camp for clues about Syska.",
      "complete": "I found the camp where Syska was seen doing black market business with the Flame Legion. When I tried to investigate, I was confronted and attacked by a series of baffling mesmer illusions. Whoever cast the illusions was determined to keep me out, but I prevailed and gained access to the camp."
    },
    {
      "active": "Search the camp for more clues.",
      "complete": "I found Tactician Syska\u0027s body and realized the \"Syska\" I\u0027ve met must be a disguised mesmer. The Pact can\u0027t afford an enemy agent embedded so high up in the chain of command, so I set out to send word to Trahearne before the impostor can do any more damage."
    },
    {
      "active": "Notify Ignavus Ridgerunner of your discoveries.",
      "complete": "Syska\u0027s former partner in crime, Ignavus, was only too happy to send word to Trahearne on my behalf. He hoped that helping me would count in his favor if his black market weapons deals ever came to light, but my only concern was protecting Trahearne and the Pact from the impostor\u0027s illusory attacks. I set out to Oxbow Isle so I can talk to Trahearne face to face."
    }
  ],
  "id": 302
}