{
  "name": "Hearts and Minds",
  "level": 80,
  "story": 25,
  "goals": [
    {
      "active": "Storm Mordremoth\u0027s inner sanctum.",
      "complete": "In the depths of Maguuma, we scaled the twisted spire inside the massive tree guarding the jungle\u0027s heart. With the Jungle Dragon distracted by the full-scale assault happening outside, my allies and I infiltrated the structure and found Marshal Trahearne. After discussing the situation, Trahearne informed us that, because he was now part of the Jungle Dragon, he could serve as a conduit into Modremoth\u0027s mind. We formulated a plan to challenge him in a final confrontation."
    },
    {
      "active": "Explore Mordremoth\u0027s nightmare.",
      "complete": "I had to choose two allies to accompany me into Mordremoth\u0027s nightmare while the others stood watch to protect our bodies from any threats. The challenges we faced inside Mordremoth\u0027s mind tested our resolve, projecting dark reflections of my friends. In the end, we overcame the shadows and used powerful rifts to restore their true natures, protecting them against further corruption. All that was left to do was to face the beast head on. To defeat Mordremoth."
    },
    {
      "active": "Defeat Mordremoth!",
      "complete": "Mordremoth tried to twist our minds into believing that more of our compatriots had turned against us; he was not only a threat to our lives, but to our sanity as well. But once again we proved ourselves up to the task and showed that true power comes from the bonds we forge from loyalty, not subservience. The Jungle Dragon\u0027s mental and magical defenses were formidable, but we prevailed."
    },
    {
      "active": "Regroup with your allies and bring things to an end.",
      "complete": "We returned to the waking world to find Mordremoth still alive; its essence took shelter inside Trahearne, and there was no way to finish off the dragon without also killing the marshal. At his urging and with great regret...I ended Trahearne\u0027s life. Mordremoth was destroyed—once and for all. The dragon\u0027s death sent an enormous wave of magical energy across the entire jungle; it remains to be seen what effect this wave will have on the region, and the entire world.\n\nBut that mystery can wait for tomorrow. Right now, we have more important things to get done: to remember those we\u0027ve lost, to heal those who were hurt, to care for those who survived. The losses and sacrifices we\u0027ve endured...this victory has to be worth the price we paid. We must make them count. I don\u0027t know what the future holds, but we must be prepared for whatever awaits us."
    }
  ],
  "id": 404
}