{
  "name": "Remembering Scarlet\u0027s War",
  "level": 1,
  "story": 39,
  "goals": [
    {
      "active": "Read Ela\u0027s mail titled \"History Lesson.\"",
      "complete": ""
    },
    {
      "active": "Visit Ela Makkay in Lion\u0027s Arch.",
      "complete": "I met with Magister Ela Makkay of the Durmand Priory, who recounted Scarlet\u0027s War to me. Though many battles were fought throughout her campaign, Scarlet was focused on a single goal: to locate and exploit a ley line—a current of magical energy flowing beneath the earth. She enlisted help from unlikely allies through false promises. Her armies struck without warning, killing all who stood in their way and destroying everything in their path.\n\nWith the help of some new friends—Braham, Rox, Taimi, Marjory, and Kasmeer—I was able to predict Scarlet\u0027s assault on Lion\u0027s Arch, but all was for naught. The Captain\u0027s Council failed to prepare adequately. The city was almost completely destroyed in the attack. Countless citizens died during the fighting, many of them poisoned by gas. We drove off the attackers and took the battle to the Breachmaker, where we took down Scarlet once and for all. But her drill pierced the ley line under the harbor and sent a massive surge of magic into the Maguuma, where she initiated a chain of events that would change Tyria forever.\n\n\n\u003cc\u003d@Quest\u003eUpdate from ArenaNet\u003c/c\u003e\nSelect missions from Living World Season 1 can now be replayed from the Scrying Pool in the Eye of the North. To unlock the quest to relive these missions, complete the story chapter \"Visions of the Past: Steel and Fire.\"\n\n\u003cc\u003d@Warning\u003eMessage from ArenaNet\u003c/c\u003e\nLiving World Season 1 was a series of live content events that ran from January 2013 to March 2014. It chronicled Scarlet Briar\u0027s war on Tyria, culminating in the destruction of old Lion\u0027s Arch and the awakening of a powerful entity. The story was designed to be experienced as it happened. Unlike Season 2, it is currently unavailable for episodic replay, so we\u0027ve created the Scarlet\u0027s War recap to inform you of the events that bridge the gap between the end of the Personal Story (circa 1325 AE) and Living World Season 2 (1327 AE)."
    }
  ],
  "id": 415
}