{
  "name": "\"Where\u0027s Balthazar?\"",
  "level": 80,
  "story": 66,
  "goals": [
    {
      "active": "",
      "complete": ""
    },
    {
      "active": "Begin the search for Balthazar in the Divinity\u0027s Reach palace temple.",
      "complete": "Taimi has no idea where Balthazar is, so it\u0027s up to me to find the trail, starting with the head priest of Balthazar in the palace temple. He couldn\u0027t help me, though it\u0027s obvious the return of Balthazar has affected his and his followers\u0027 attitudes. Countess Anise was already there, cautioning him about brawling in the city, and so I had a chance to speak with her. Turns out, Kasmeer told her of my goal, and she suggested one way I might achieve it: the Eye of Janthir. One of her exemplars is out there now, tracking it, and it\u0027s likely to lead me to Balthazar; thus, I\u0027m off to find this Shining Blade exemplar."
    },
    {
      "active": "Rendezvous with the Shining Blade exemplar.",
      "complete": ""
    },
    {
      "active": "Follow in the exemplar\u0027s wake.",
      "complete": ""
    },
    {
      "active": "Search the White Mantle stronghold.",
      "complete": "I started off in the direction Anise had suggested, and before I knew it, I was following a trail of White Mantle corpses. I found the exemplar in a trap, so it\u0027s a good thing I came along when I did. I rescued her, and we proceeded together from there, despite her attempts to get rid of me."
    },
    {
      "active": "Destroy the bloodstone shards.",
      "complete": ""
    },
    {
      "active": "Find the aspect.",
      "complete": "The Mantle hideout turned into a labyrinth of traps and warded doors, but we made it to the aspect, finally. No Balthazar, but we killed a Mantle justiciar, so it was productive. The exemplar refuses to tell me what she plans to do with the aspects, though. Hopefully Anise will. We\u0027re heading to Divinity\u0027s Reach next. The exemplar is going to take me to Shining Blade headquarters."
    }
  ],
  "id": 469
}