{
  "name": "The Sacrifice",
  "level": 80,
  "story": 72,
  "goals": [
    {
      "active": "Locate and confront Balthazar.",
      "complete": "We went to Makali Outpost, where Balthazar\u0027s Forged army was engaged in a pitched battle against the Crystal Dragon scion, Vlast. Agent Kito was evacuating villagers from the war zone, but he paused long enough to tell us Balthazar himself was nearby, closing in on Vlast.\nCanach and I tracked Vlast to a plateau, but before we could make contact, Balthazar\u0027s herald intercepted us. Though she fought viciously, we made her pay the ultimate price for the innocents she slaughtered in Balthazar\u0027s name. In the end, she actually seemed to welcome the end of her tenure as Balthazar\u0027s murderous slave.\nBut we badly underestimated Balthazar himself. He leveled us with a devastating show of newfound power...though he spared Rytlock, even calling our guildmate \"friend.\" As I lie dazed in the sand, Balthazar moved in for the kill, but Vlast took the deathblow intended for me. I can only wonder why—was he tired of fighting, eager to die? Was he so heroic that he gave his own life for a total stranger\u0027s? Or did he somehow sense Aurene\u0027s bond with me, and he sacrificed himself to save his sister\u0027s chosen champion?\nWhatever the reason, Vlast died in my stead, and his explosive death throes sent Balthazar hurtling away in a flash of light and heat. When I regained my senses, Balthazar was gone and the desert littered with crystal shards of Vlast\u0027s body, some of which contain messages from Vlast to Aurene.\nI confronted Rytlock about Balthazar calling him \"friend,\" and eventually Rytlock revealed the truth: while searching for his sword Sohothin in the Mists, he found and freed a chained figure. That prisoner turned out to be Balthazar, and by releasing him, Rytlock made Balthazar\u0027s devastating campaign against the Elder Dragons possible. Rytlock swore he\u0027d set things right, but first we have to learn more about what we\u0027re up against. To obtain the answers we need, I set out to collect more of Vlast\u0027s crystal messages."
    }
  ],
  "id": 482
}