{
  "name": "Crystalline Memories",
  "level": 80,
  "story": 79,
  "goals": [
    {
      "active": "Travel to the site of Glint\u0027s Lair and find the weapon that Vlast spoke of.",
      "complete": "I met my team at the Branded crater outside Glint\u0027s Lair, but the area was crawling with Forged. After clearing them out, we discovered unmistakable signs that Balthazar has built himself a war machine that harnesses magic from dragon crystals. We also found remnants of Glint\u0027s power—scattered crystalline essences and memories that enabled us to open a portal to Glint\u0027s Lair."
    },
    {
      "active": "Explore the inside of Glint\u0027s Lair and search for the weapon mentioned by Vlast.",
      "complete": "Inside Glint\u0027s Lair, we found one of Glint\u0027s memories contained in a crystal shard. It hinted at the true purpose of Glint\u0027s legacy but made no mention of the weapon Vlast described. Fortunately, we were able to find the weapon ourselves: a dragonsblood spear with the power to kill Kralkatorrik. This was the weapon Glint created and gave to Destiny\u0027s Edge years ago, before their first fight against the Crystal Elder Dragon, which ended in the tragic deaths of both Snaff and Glint herself.\nAfter some intense discussion, I made the decision to destroy the spear. Though I might end up regretting it, I couldn\u0027t risk Balthazar getting his hands on anything that could jeopardize our mission—or Tyria\u0027s fate.\nStill with no clues as to Balthazar\u0027s motivations, Kasmeer strongly suggested we take the matter directly to the gods, reasoning that they and only they have both the power and the knowledge we need to make a stand. As a first step, we all agreed to travel to the Tomb of Primeval Kings and use the portal there to enter the Mists. Our hope is to make contact with the gods and learn the truth about Balthazar\u0027s return, and the reasons for his campaign against the Elder Dragons, before securing help from the gods themselves."
    }
  ],
  "id": 484
}