{
  "name": "Facing the Truth",
  "level": 80,
  "story": 80,
  "goals": [
    {
      "active": "Seek an audience with the gods.",
      "complete": "We entered the portal at the Tomb of Primeval Kings, only to be separated and transported to a strange, desolate landscape. After searching the area, I was able to reunite with the others and discovered a mysterious puzzle that had been hidden by a sandstorm. \n\nKasmeer believed the puzzle to be a challenge set by the gods, and she was proven right. After completing the puzzle, a portal opened up before us, leading to...perhaps, the gods?"
    },
    {
      "active": "Seek an audience with the gods.",
      "complete": "We entered the portal and found ourselves in a library unlike any other I\u0027ve ever seen. We came hoping to find the gods, but Kormir, the Goddess of Truth, was the only deity we found. She granted us an audience in her sanctum and answered some of our questions, but in this case the truth was hard to hear.\nKormir told us the gods had left Tyria completely to avoid a cataclysmic battle with the Elder Dragons that would have destroyed the world they were trying to preserve. As Kormir described it, Balthazar refused to accept this decision and went so far as to threaten the other gods if they went through with their plan.\nIn response, the rest of the Six stripped Balthazar of his power and chained him in the Mists, where he remained until Rytlock unwittingly released him. Once freed, Balthazar set out to recover his lost power, defeat the Elder Dragons, and claim their magic for himself in order to take vengeance on the other gods for imprisoning him.\nKormir concluded by saying the other gods were long gone, and she was about to follow them, so they could not and would not help us against Balthazar. Learning the gods had abandoned Tyria was painful, especially for Kasmeer. But she ultimately accepted that, as Kormir pointed out, the time for prayers is past. This world belongs to us mortals now, and it\u0027s our responsibility to defend it.\nBefore she left to reunite with her fellow gods, Kormir provided us a single bit of guidance in our fight against Balthazar: to seek answers in the desert. It\u0027s not much to go on, but I\u0027ve instructed the team to split up and search: Kasmeer will go north, Canach and Rytlock will ask Canach\u0027s contacts in the Order of Shadows, and I\u0027ll head south to scour the Riverlands. Balthazar is our problem to solve, and while knowing the solution is out there isn\u0027t as good as knowing the solution itself, it\u0027s a start."
    }
  ],
  "id": 493
}