{
  "name": "Enemy of My Enemy",
  "level": 80,
  "story": 75,
  "goals": [
    {
      "active": "Gather information and form a strategy to recruit Palawa Joko\u0027s generals.",
      "complete": "Our ruse worked. Archon Iberu came to investigate the supposed \"Sunspear uprising\" I manufactured. He was not happy to see us, or about being fooled, and he angrily attacked. We defeated him, and then Kas cloaked us in an illusion to make us appear as Iberu and his Awakened entourage. We infiltrated the Bone Palace and I met with Grand Vizier Utumishi (a wormy little sycophant trying to keep Joko\u0027s kingdom running while the tyrant is away) and Wurmmarshal Ekolo, one of Joko\u0027s battle-hardened leaders.\nEkolo was eager to join the fight against Balthazar, and as Iberu, I blustered and threatened Utumishi until he gave up the locations of two more Awakened field marshals. Then I rejoined my team and instructed them to split up so we could learn more about our targets before recruiting them."
    },
    {
      "active": "Seek the aid of Troopmarshal Olori Ogun.",
      "complete": "I found Troopmarshal Ogun at his encampment. He was ready to follow me into battle willingly, but his newly Awakened troops weren\u0027t combat ready, and so he could not leave his post for fear that the Forged base nearby would overrun and disrupt the supply lines he\u0027d been ordered to defend.\nI agreed to do his job for him and assaulted the base with a small squad of his Awakened troops. We found and destroyed the portal that Balthazar was using to send in Forged reinforcements. After my mission was complete, Ogun agreed to lead his soldiers against Balthazar under my command. He\u0027ll stage his army outside Kodash and wait for my signal."
    },
    {
      "active": "Seek the aid of Beastmarshal Oluwa Eranko.",
      "complete": "I headed to the Necropolis to meet my next Awakened recruit: Beastmarshal Oluwa Eranko, a stubborn but proud commander of Joko\u0027s beast cavalry unit. She wasn\u0027t willing to lend me her soldiers unless I proved my riding prowess, so I mounted up and played her little game of tag to show her what I\u0027m capable of, and to demonstrate that following my lead wouldn\u0027t ruin her unit\u0027s impeccable reputation.\nI\u0027ve got my army now. Time to take down a god."
    }
  ],
  "id": 501
}