{
  "name": "Under the Stars",
  "level": 80,
  "story": 85,
  "goals": [
    {
      "active": "Travel to Istan.",
      "complete": "Aurene sent us a vision of widespread chaos and destruction, and a ruined city that Agent Kito identified as Fahranur. Agent Kito and I are proceeding to Istan to contact the Sunspears, who may know of a way into Fahranur. Rytlock, Canach, and Taimi will remain in Amnoon to clean up after the attack by Kralkatorrik\u0027s minions. \n\nAt Agent Kito\u0027s direction, I was able to arrange for passage to Istan by stowing away aboard a small fishing vessel."
    },
    {
      "active": "Determine the location of the Astralarium.",
      "complete": "In Istan, I proceeded to the Astralarium, where Agent Kito suggested I might be able to contact the Sunspears. This remarkable conservatory was teeming with scholars dedicated to the study of astronomy and the history of Istan, but the academic fervor was somewhat dimmed by the presence of Mordant Crescent agents pushing the scholars to limit the history they teach and record to Joko\u0027s propaganda.\n\nI made contact with the head archivist, Rhadha, who was fearful that my presence might draw undue attention and requested that I disguise myself as a visiting scholar. This was the only way I could gain access to the archives where the entrance to the Sunspear base was located without arousing the suspicion of the many pro-Joko researchers or the Mordant Crescent patrols who monitored the facility."
    },
    {
      "active": "Earn Archivist Salwa\u0027s trust.",
      "complete": "After posing as a scholar to deflect the suspicions of the Mordant Crescent guards and pro-Joko researchers at the Astralarium, I sought out Head Archivist Rhadha, who told me the key to locating the secret Sunspear base was contained in a book called \"Nightfall,\" located in the main archives. Rhadha advised me to contact Archivist Salwa, who controlled access to these archives.\n\nArchivist Salwa was understandably hesitant to allow me to enter the sanctum until I could prove to her that I supported those seeking to end the vicious rule of the lich king, Palawa Joko."
    },
    {
      "active": "Discreetly enter the base in the archives.",
      "complete": "I made my way to the bottom floor of the Astralarium library. Using the key given to me by Archivist Rhadha, I deduced the incantation required in order to gain access to the archives. Saying \"Joko is false\" while standing in front of the door transported me into a secret Sunspear base, where I was greeted by Agent Kito and First Spear Hakima. Hakima informed me that only Spearmarshal Zaeim, the leader of the Istani Sunspears, knows the way in to Fahranur, and I should seek him out in Champion\u0027s Dawn."
    }
  ],
  "id": 506
}