{
  "name": "The Charge",
  "level": 80,
  "story": 86,
  "goals": [
    {
      "active": "Assault Rata Primus to stop Joko.",
      "complete": "While Rox led the Olmakhan in a ground assault, Braham and I infiltrated Rata Primus from above with the help of Sayida and her airship. Inside, Joko\u0027s Awakened were locked in battle with the Inquest forces. We tracked down the gate hub, defeated a massive force of Awakened, and disabled the gates, finally putting a stop to Joko\u0027s invasion of Tyria.\n\nWe reached the lab where Gorrik and Blish had holed up, and we were shocked to learn that Blish\u0027s consciousness had been transferred into a golem body. Before we could fully process this, the containment-vault alarm began to blare, and Gorrik revealed some disturbing news—the Inquest had recovered samples of the ancient and deadly Scarab Plague in Fahranur, and now Joko was trying to seize it.\n\nWe raced to the containment vault, but we were too late. Joko damaged the remaining asura gate and set Mordant Crescent Commander Lonai on us while he fled with the plague. The damaged gate sucked us in, and Braham and I braced ourselves for the battle to come."
    },
    {
      "active": "Defeat Commander Lonai and find a way back to Rata Primus.",
      "complete": ""
    },
    {
      "active": "",
      "complete": ""
    },
    {
      "active": "",
      "complete": ""
    },
    {
      "active": "",
      "complete": "Braham and I battled Lonai while being shifted to increasingly remote and strange locations. When we finally defeated her, Blish and Gorrik managed to transport us back to Sayida\u0027s airship just as Rata Primus\u0027s self-destruct protocol detonated."
    },
    {
      "active": "Reunite Blish and Gorrik with Taimi.",
      "complete": "Despite my concern about Taimi\u0027s reaction to Blish\u0027s golem state, she was delighted at the reunion. The three of them planned to work together as we all prepare to deal with whatever terrible plans Joko has for the Scarab Plague."
    }
  ],
  "id": 513
}