{
  "name": "The Crystal Dragon",
  "level": 80,
  "story": 89,
  "goals": [
    {
      "active": "Ready your forces for the battle with Kralkatorrik.",
      "complete": "I went over the plan of attack and did what I could to reassure our gathered forces that we had Kralkatorrik\u0027s own prophecy—his vision of a world without him—on our side. The forge master, meanwhile, informed me that the modifications to the resonance crystals were complete. With everything ready and everyone in place, I joined Aurene and Caithe near the first resonance crystal."
    },
    {
      "active": "Begin the assault on Kralkatorrik.",
      "complete": "I told Aurene it was time to put our plan in motion. She took off and entered the Mists. Moments later, she came charging back with the Kralkatorrik right behind her. As he pushed his massive head and neck into the forge, Sayida\u0027s fleet blasted him with cannon fire, and Canach hammered him with a crushing landslide. These attacks had already stunned Kralkatorrik when Aurene and I struck the next massive blow by activating the first resonance crystal. The blow revealed a weak point where we focused our attack. Taimi\u0027s tracker readings confirmed that our plan was working—we were really hurting him."
    },
    {
      "active": "Continue the assault on Kralkatorrik.",
      "complete": "We fought our way through Kralkatorrik\u0027s minions toward the second resonance crystal. Zafirah made a timely entrance with a fierce group of Zaishen she had evidently rounded up to support our efforts. With their help we fought our way to the second resonance crystal and struck another massive blow against Kralkatorrik."
    },
    {
      "active": "Finish the assault on Kralkatorrik.",
      "complete": "We ran into trouble on our way to the third resonance crystal, only to have unexpected allies appear and lend a hand: Varya and her dredge burst in on a tank they\u0027d liberated from the Branded. With their help, we made our way to the third resonance crystal and activated it.\n\nThe blow from the final resonance crystal sent Kralkatorrik crashing to the ground. But he wasn\u0027t finished yet. As Aurene and I approached, he reared up and fired a deadly blast directly at me. Aurene darted in front of it and fired a blast of her own, causing a massive explosion that knocked me unconscious. Flashes of a wounded Kralkatorrik slinking away filled me with dread. But it wasn\u0027t until I regained consciousness and found my way back to the others that I saw the tragic results in full. Aurene was dead, impaled on Kralkatorrik\u0027s Brand crystals. As we struggled with shock and grief, Braham wondered out loud what we could possibly do now. I had to tell him the truth—I didn\u0027t know."
    }
  ],
  "id": 542
}