{
  "name": "Scion \u0026 Champion",
  "level": 80,
  "story": 89,
  "goals": [
    {
      "active": "Listen to Caithe\u0027s update.",
      "complete": "I reached out to Caithe over comms to see if she\u0027d heard from Aurene. She hadn\u0027t, but she was following up on a suspicion she had mentioned in our conversation at Sun\u0027s Refuge—she was convinced that the dwarves were involved in Glint\u0027s legacy. Unfortunately, her plan to talk directly to Ogden about this suspicion hit a snag. The Priory were apparently resistant to the idea of a known thief wandering their halls and had refused her entry. I offered to meet her at the Priory and act as her \"chaperone\" so we could speak with Ogden together."
    },
    {
      "active": "Join Caithe at the Durmand Priory.",
      "complete": "I met up with Caithe at Durmand Priory. She was worried about Aurene, given the dangers ahead, and asked to be included in the preparations for our confrontation with Kralkatorrik. I told her I\u0027d be grateful for the help, and together we went in to speak with Ogden."
    },
    {
      "active": "Follow up on Glint\u0027s legacy.",
      "complete": "Ogden revealed that Glint had partnered with the dwarves at Thunderhead Keep to develop the Dragonsblood Forge, where the original Dragonsblood Spear was created. To prepare for the ultimate downfall of Kralkatorrik, Glint had intended that we meet our allies there and arm them for the battle. But before that could happen, Aurene and I would have to prove our readiness by facing a series of trials Glint created in an extension of her lair in the Mists. \n\nWith Ogden promising to arrange for the Pact and our allies to meet us at Thunderhead Keep, Caithe and I stepped through the portal created by Glint\u0027s hourglass. We found Aurene curled up around Glint\u0027s crystalline remains, forlorn. Caithe and I did our best to reassure her that she wouldn\u0027t be alone on the difficult road ahead. Then, Aurene and I—scion and champion—entered Glint\u0027s trials."
    },
    {
      "active": "Work with Aurene to pass Glint\u0027s first trial.",
      "complete": "Glint\u0027s voice guided us through her trials. The first trial challenged us to facilitate Aurene\u0027s absorption of powerful magics."
    },
    {
      "active": "Work with Aurene to pass Glint\u0027s second trial.",
      "complete": "In the second trial, we learned to channel Aurene\u0027s magic into shaping and molding Kralkatorrik\u0027s Brand crystals."
    },
    {
      "active": "Work with Aurene to pass Glint\u0027s final trial.",
      "complete": "In the third and final trial, we faced our greatest fears. For me, it was the prospect of failing Aurene and the world. For Aurene, it was a Branded version of herself—the manifestation of failing against Kralkatorrik.\n\nIn the end, we passed Glint\u0027s trials by proving our partnership and trust for one another.\n\nGlint then revealed Kralkatorrik\u0027s greatest secret: in a vision, he had foreseen a world without him, a world at peace. And it had terrified him. Glint expressed her trust in us and our ability to realize that prophecy by working together. With that, we rejoined Caithe and entered Glint\u0027s portal to Thunderhead Keep, ready to use the Dragonsblood Forge to arm our allies for the battle of our lives."
    }
  ],
  "id": 543
}