{
  "name": "Dragonsblood",
  "level": 80,
  "story": 89,
  "goals": [
    {
      "active": "Learn about the Dragonsblood Forge.",
      "complete": "We arrived at Thunderhead Keep to find the Pact and our other allies already gathered there. The Keep was an impressive place, built long ago by the dwarves and maintained by the Exalted and Zephyrites since the days of Glint. Ogden directed us to Forge Master Hilina, the Exalted blacksmith who instructed us on how to start the process of forging new Dragonsblood weapons. We would begin by retrieving quenching oil from a dredge extraction operation to the south."
    },
    {
      "active": "Retrieve oil from the dredge.",
      "complete": "I sought out the dredge community on the ice floe to the south. They had an extensive oil extraction operation, but conflict with the Branded had cost them many lives and damaged their equipment. Still grieving from their losses and left with barely enough oil to get through the winter, their leader, Varya, was in no mood to share what little they had left. By channeling Aurene\u0027s magic I was able to clear the Brand crystals from their equipment, freeing up their oil reserves and earning Varya\u0027s cooperation."
    },
    {
      "active": "Secure an intact weapon mold.",
      "complete": "Taimi reached out over comms to report that the original mold used in the forging process had cracked and we would need to track down a replacement. Ogden suggested we try the tomb of Frodak Steelstar, a long-dead dwarven weaponsmith who had apparently worked with Glint in forging the original Dragonsblood Spear. While searching for his tomb, I came across the ghost of Frodak himself and learned that a vicious graveling had displaced him from his tomb. By ridding his tomb of the graveling, I was able to secure a replacement mold for our new Dragonsblood weapons."
    },
    {
      "active": "Forge a new Dragonsblood weapon.",
      "complete": "With the forge master\u0027s guidance, Aurene and I put the Dragonsblood Forge to use. Though the original Dragonsblood Spear was forged using a shard from Kralkatorrik\u0027s body, the forge master explained that we would have to make do with Brand crystals from Kralkatorrik\u0027s minions. Nevertheless, the spears we turned out looked like fine weapons, worthy of Glint\u0027s forge. All we needed now was to test their effectiveness on the Branded."
    },
    {
      "active": "Test the power of the new Dragonsblood weapons against the Branded.",
      "complete": "While Forge Master Hilina pressed on with forging more of the new Dragonsblood weapons, I tracked down a number of Branded enemies to test our initial batch. Though the weapons were clearly not as powerful as the original Dragonsblood Spear, they were still quite effective and would surely give us an advantage if we could make enough for all of our allies. I reached out to Taimi and Gorrik to report my findings, and Gorrik began calculating how much time we would need."
    }
  ],
  "id": 544
}