{
  "name": "Pantheon of the Wild",
  "level": 80,
  "story": 97,
  "goals": [
    {
      "active": "",
      "complete": ""
    },
    {
      "active": "Find all three Spirit totems.",
      "complete": "To open the door in the norn ruins, Braham would need the help of the Spirits of the Wild. Since Wolf, Raven, Snow Leopard, and Bear don\u0027t seem to be talking to him right now, he\u0027s decided that the other Spirits will need to come together in their stead...including the corrupted Ox, Eagle, and Wolverine.\n\nWe\u0027ve dealt with these three in the Bjora Marches, and I have to say I wasn\u0027t looking forward to getting permission to carry their lost totems back to the ruins.\n\nEach of the three corrupted Spirits of the Wild forced me to complete a challenge before allowing me to take their totems, but now I\u0027m ready to return to Braham."
    },
    {
      "active": "Open the door in the norn ruins.",
      "complete": "The Spirits of the Wild spoke through Braham, offering one final trial before they would help us enter the door leading into the keep. I had expected trouble from Ox, Eagle, and Wolverine before, but none of us could have anticipated what would come next.\n\nAs the power of the Spirits filled their totems, we knew that one would never come: Owl, for the norn had said time and again that she sacrificed herself to save her people when Jormag threatened them. Imagine our surprise when Owl\u0027s totem lit up with her power—a power that simply should not have been there.\n\nBraham looked stricken. He realized the truth then: that Owl was not dead, but had instead cut herself off from the Mists and the norn when she was corrupted by Jormag long ago. She returned to this temple, this sacred place where the Spirits and the norn first truly came together, and effectively went into hiding.\n\nNow Braham has brought her back, and thanks to the corruption within her, it is possible that Jormag now has more than enough power to awaken.\n\nKnowing that time was not on our side, we hurried through the door into the keep."
    }
  ],
  "id": 578
}