{
  "name": "One Charr, One Dragon, One Champion",
  "level": 80,
  "story": 97,
  "goals": [
    {
      "active": "",
      "complete": ""
    },
    {
      "active": "",
      "complete": ""
    },
    {
      "active": "Prevent Jormag\u0027s awakening.",
      "complete": "We didn\u0027t make it in time.\n\nAnd even if we had, there was no way for us to have foreseen what would happen.\n\nWe\u0027d made it to the top of Jormag\u0027s keep, clearing the Dominion soldiers and securing the area for Malice and Efram to join us. As we rushed into Jormag\u0027s chamber, we had no idea what to expect.\n\nThe former Blood imperator had used the Svanir to help him capture the totems of Wolf, Bear, Snow Leopard, and Raven, positioning them before Jormag in a kind of twisted ritual. Bangar was planning to corrupt the Spirits of the Wild and use them as a carrot to control Jormag, the same way Jormag used the powers of Ox, Eagle, and Wolverine to control Drakkar in the Bjora Marches.\n\nWe managed to stop Bangar, but only for a moment; Ryland made his presence known before long, chastising his imperator for trying to manipulate the Elder Dragon using the norn Spirits. Ryland surrounded each of the four totems with powerful magic, trapping them for Jormag and guaranteeing their corruption if we did not intervene.\n\nWith Braham, Rytlock, and Crecia\u0027s help, we managed to free all four Great Spirits from their fate, but not in time to prevent Jormag from waking.\n\nWe could never have guessed what would happen next: Jormag did not choose Bangar as their champion. Instead, Jormag turned Bangar into their \"Voice,\" leaving him with us as a kind of twisted gift.\n\nRyland sensed an opportunity, and he took it. Jormag clearly saw something in the young charr, something they appreciated, and turned Ryland into a monstrous creature of ice and frost. Ryland was Jormag\u0027s champion.\n\nThey escaped almost immediately after, leaving us with Bangar and a thousand questions."
    },
    {
      "active": "Debrief with your allies at the Eye of the North.",
      "complete": "Aurene did not mince words. The situation is bad. Worse than we could possibly know.\n\nShe said that when Jormag woke, there was a kind of tremor throughout Tyria. She said it felt like the world was calling out in pain.\n\nJormag is gone. Ryland, too. And we don\u0027t know where they are, or what their plans are.\n\nAll we can do is wait. Fortunately—though I use the term loosely—Jormag left us with Bangar, shackled by ice and strange magic, and capable of communicating with us on Jormag\u0027s behalf. When the ice dragon wishes to speak with us, it will be through Bangar.\n\nSo we\u0027ve decided to keep the former imperator imprisoned in the Eye of the North under Aurene\u0027s watchful eye. Now that Jormag is freely roaming the world, nobody is safe. We must be ever-vigilant, and prepare for the inevitable war we had all hoped to prevent."
    }
  ],
  "id": 580
}