{
  "name": "Roaring Flames",
  "level": 80,
  "story": 98,
  "goals": [
    {
      "active": "",
      "complete": ""
    },
    {
      "active": "Travel to the Eye of the North and meet with Aurene.",
      "complete": ""
    },
    {
      "active": "",
      "complete": ""
    },
    {
      "active": "Read the urgent letter.",
      "complete": ""
    },
    {
      "active": "Protect Fields of Ruin",
      "complete": "I received information that Ebonhawke was in danger, so I put the word out to my guildmates to see if anyone was available. Kasmeer agreed to muster help. Crecia was already in the area dealing with Renegades, so she offered assistance. This made Kas uneasy due to the long-standing tension between humans and charr, treaty or not. That a newly minted imperator would be marching into the city gates would no doubt exacerbate feelings of distrust.\n\nI feared that things would spiral out of control, but Crecia and her soldiers proved through their actions that they weren\u0027t here to capitalize on battlefield confusion. Kas softened her stance, and the two worked out their differences. By the time the conflict was over, hundreds of destroyer husks lay smoldering on the ground. We\u0027re still a ways away from winning this war, but every victory counts."
    },
    {
      "active": "",
      "complete": ""
    },
    {
      "active": "Protect Thunderhead Peaks",
      "complete": "Caithe alerted us to a situation that was brewing at Thunderhead Peaks. Braham offered to pitch in against the destroyers, so we met at the designated location where the battle was already underway. We met up with Myrun Skialkin, a member of Caithe\u0027s Crystal Bloom, who was tending to the injured and trying to control the situation as best they could.\n\nThroughout the fight, Braham and Myrun talked about Jormag and Primordus being twins. It seemed far-fetched at first, but the more they discussed, the more it made sense. It still doesn\u0027t explain how Braham is potentially involved in all this, how him being prophesized as the key to killing Jormag. What does that mean for Primordus, then?\n\nThe battle moved to the Forge, seemingly implying that the intense heat may have attracted Primordus\u0027 minions. We don\u0027t really know why they picked this spot to emerge. It\u0027s true that wherever there is a waypoint, a ley line runs through it. Perhaps the magic concentration was especially strong here? Hard to say.\n\nBefore we could overthink it, an especially nasty destroyer emerged on the scene. Its shell was especially tough and seemingly impervious to our attacks. A dwarf suggested using spears against it, similar to the way that Kralkitorrik was bested. Braham seemed unconvinced, but Myrun theorized that I could alter the weapons using Aurene\u0027s gift, thus exploiting their weakness.\n\nIn the ebb and flow of the fight, we could see Braham\u0027s awareness and connection to them growing stronger. It was as if his ability to sense them was also attracting them. He used this to his advantage to swing the fight in our favor, but ended up just as confused as when we started. Seems his path to fulfilling his destiny as the \"Norn of Prophecy\" is rife with unexpected turns."
    }
  ],
  "id": 581
}