{
  "name": "Defending Tyria",
  "level": 80,
  "story": 98,
  "goals": [
    {
      "active": "",
      "complete": ""
    },
    {
      "active": "Protect Metrica Province",
      "complete": "At Taimi\u0027s urging, I headed to Metrica Province to fend off the destroyer threat. With Braham\u0027s help, we evacuated those we could and did our best to control the devastation. Taimi then enlisted our help to collect dragon research data from deeper in the caves, all in an attempt to arm Ryland and Jormag with information to help them neutralize the fire dragon threat. The whole \"uneasy alliance\" had me worried. Neither of those two are to be trusted. That my friend would so easily overlook the obvious gave me pause.\n\nTaimi assured me that this was in everyone\u0027s best interest. Enemy of my enemy and whatnot. But it was clear that she and Braham were at odds here. Simply put, asura want Primordus dead, and the norn want Jormag gone. I just want to fix this whole mess. I learned that Jormag and Primordus are siblings, which would explain why we need to somehow turn them against each other. But first we\u0027d need to learn more about them to exploit their weakness.\n\nWe followed the destroyer energy signature until we confronted its source—a large and ornery critter that didn\u0027t take kindly to our pursuit. It was a drawn-out fight, but we eventually defeated it. The feeling of elation was short lived, however, as tensions between Braham and Taimi boiled over. They both admitted their fears of the Elder Dragon threat that jeopardized their homes, their people. Taimi can only hide her emotions inside a lab for so long before she cracks. And Braham is...changing. The weight of prophecy. The death of his mother. The plight of his homeland. It\u0027s all aging him.\n\nAnd now he\u0027s able to sense Primordus\u0027s minions. Almost like a skilled hunter would. He doesn\u0027t quite understand the changes he\u0027s going through. I just hope he\u0027s able to keep it together."
    },
    {
      "active": "",
      "complete": ""
    },
    {
      "active": "Protect Brisban Wildlands",
      "complete": "Watchful Source, a sylvari settlement in Brisban Wildlands, was the next destroyer target. I headed there and joined up with Caithe, who helped fend off the attackers and protect the innocents. Ryland made a surprise appearance, extending his hand in aid. There wasn\u0027t time to debate my discomfort, so I put my reservations aside and observed his actions throughout the encounter.\n\nCaithe and Ryland conversed along our route, sparring with words. The young charr had learned persuasiveness from Bangar, but with Jormag influencing him he was even more convincing. He compared himself to her, using their closeness to Elder Dragons as a common reference point. The difference is that Aurene lets us be who we are—and inspires us to be more. Jormag just takes what they want and lies to you to surrender it willingly.\n\nThey debated their respective Elder Dragons\u0027 roles in the balance of magic. Control versus order. Defense versus offense. I could tell he was fishing for information so that his master could use it against their sibling. By the end of the fighting, it was clear that Aurene was choosing to let me—and the rest of Tyria—determine the outcome rather than get directly involved.\n\nCaithe and the Crystal Bloom would certainly use the gifts bestowed on them by Aurene to heal the world\u0027s wounds, but Ryland and his Frost Legion would use any advantage they could get to leverage it against Primordus. This little \"alliance\" of his will only last for as long as it suits him."
    },
    {
      "active": "",
      "complete": ""
    },
    {
      "active": "Protect Gendarran Fields",
      "complete": "It wasn\u0027t long before we received a call from Marjory. She and Jhavi from the Vigil were fending off increasing numbers of destroyers outside Lion\u0027s Arch, and the situation was getting worse by the minute. I agreed to meet them in Gendarran Fields, where we held the line outside the city.\n\nAscalon Settlement was soon under siege, so we headed there with urgency. The town was overrun with destroyers of all types. With help from some allies, we eventually defeated them all and reclaimed the town. Marjory and Jhavi exchanged heated words—the battle had tested their patience and they fundamentally disagreed about what was more important: concentrating on the mission or saving the needy. Were we ready to let innocents die if it meant ultimately winning the war?"
    }
  ],
  "id": 583
}