{
  "name": "Flame vs. Frost",
  "level": 80,
  "story": 98,
  "goals": [
    {
      "active": "",
      "complete": "Rytlock contacted me while on a diplomatic mission with Efram to save the remaining Flame Legion in Fireheart Rise. Predictably, destroyers burst from the ground and threatened to murder every living thing in their path. Brimstone wasn\u0027t sympathetic to the Flame Legion—after battling the twisted faction for so many years, he\u0027d written them off as irredeemable fanatics. Efram and I disagreed. They just needed strong leadership to turn them from their misguided ways and rejoin the rest of charr society."
    },
    {
      "active": "Protect Fireheart Rise",
      "complete": "Rytlock grudgingly agreed to help us fight the destroyer invasion. While he had no love for the Flame Legion, his hate for Primordus was stronger. Besides, who could refuse an opportunity to skewer dragon minions with a flaming sword?\n\nWe set about saving soldiers and setting up defenses. Once we controlled the battlefield, we assisted Efram with his recruitment effort. \n\nThe fight culminated on the bridge (what is it with dragon minions and bridges?) where the forces of ice and fire collided and threatened to take us down. Out of nowhere, Braham entered the fray. He had been transformed into a dragon champion of Primordus, single-minded in his mission to destroy anything remotely related to Jormag. We had to get creative with to create an opening to attack our icy enemy, while also being careful not to harm Braham in the process.\n\nWe emerged victorious, though just barely. Braham escaped with his life. I had no doubt that we\u0027d face him again on the battlefield, and I feared that eventuality. Would he remember us? Would he try to kill us? Would he fall to Primordus in the process? Every outcome seemed dire.\n\nAfterward we conferred with Efram, who told us of his unification plans. I don\u0027t know if he\u0027ll be able to convince the more radical Flame Legion members. Old habits die hard, and there may be no saving them. But if he could turn most of them to his side, the future of the charr looked promising."
    }
  ],
  "id": 590
}