{
  "name": "Primordus Rising",
  "level": 80,
  "story": 98,
  "goals": [
    {
      "active": "",
      "complete": ""
    },
    {
      "active": "Read the urgent letter.",
      "complete": ""
    },
    {
      "active": "Meet with Aurene at the Eye of the North.",
      "complete": "Rytlock and I visited Bangar\u0027s cell at the Eye of the North. But Ruinbringer wasn\u0027t just our prisoner, he was also the ice dragon\u0027s. The defeated charr is now the Voice of Jormag. In his prime, Bangar could talk his way out of anything. Now, he\u0027s lucky if he gets to speak. Aurene listened to Jormag boast about Ryland, their champion, and of the army he had prepared. And Jormag spoke of the looming threat of their brother, Primordus.\n\nOur enemies are powerful and numerous. All I know is, we can\u0027t do this alone. If we\u0027re going to solve the Elder Dragon problem, we\u0027ll need to learn more about their weaknesses.\n\nTaimi reported from Rata Sum with an update on her research. She\u0027d been monitoring Mist rifts and ley lines in an attempt to track Jormag. While the ice dragon remained elusive, another discovery presented itself. At Taimi and Aurene\u0027s urging, I headed to the asura home city."
    },
    {
      "active": "Join your allies in Rata Sum.",
      "complete": "I met Gorrik at the gates. He was arguing over some logistical headache regarding his freight (likely more research equipment—where does he get his funding?). He directed me to the city center to meet with the Arcane Council. To my surprise, Ryland Steelcatcher—Jormag\u0027s new champion—had been invited by the council members. He was every bit as arrogant and sure of himself as his master, but we were running out of options, and Primordus was only gaining more power. He—and Jormag—needed asuran expertise to find a way to neutralize Primordus. So an uneasy truce was formed since we had similar goals of stopping the fire dragon.\n\nNone of us were happy about the turn of events, and all of us were suspicious of Ryland\u0027s motivations. I sent Braham down to the docks to help Gorrik with his shipping issue in hopes of letting him blow off some steam. There\u0027s a growing resentment between Braham and Ryland ever since the charr stole the norn\u0027s bow. And something tells me it won\u0027t be resolved amicably when all is said and done."
    },
    {
      "active": "Join Taimi at the Advanced Metamystics Lab and hear about her latest Elder Dragon research.",
      "complete": "We met Taimi at the Advanced Metamystics Lab to discuss her findings. There was palpable tension between Rytlock and his estranged son, and neither were interested in hiding it.\n\nTaimi shared a more detailed update on her findings. While trying to track Jormag, she picked up a series of quakes that were growing in number and intensity. The largest movement was detected under Rata Sum itself.\n\nBefore we could discuss the data in depth, powerful destroyers emerged just outside the lab. They were stronger than ever, and relentless in their quest to annihilate us. We dispatched them as fast as we could, only to hear Braham\u0027s distress call from down at the docks. Taimi reconfigured the gate to take us directly there.\n\nThe fighting at the port was fierce, and almost got worse when Ryland and his Frost Legion showed up. But they weren\u0027t looking to spar with us—instead they turned their sights on the destroyers. Together, we cleared every last wave that erupted around us. We then headed to assist the Council in their time of need.\n\nAfter the carnage, Gorrik, Taimi, and the Council set out to study these newly evolved destroyers in the hopes that they could track their subterranean movements. Ryland offered to station some of his Frost Legion in the city for protection, though his offer was declined."
    }
  ],
  "id": 595
}