{
  "name": "Wildfire",
  "level": 80,
  "story": 98,
  "goals": [
    {
      "active": "",
      "complete": ""
    },
    {
      "active": "Travel to the Eye of the North and meet with Aurene.",
      "complete": "I traveled to the Eye to consult with Aurene, but before I reached her, Taimi radioed me in a panic. She\u0027d detected a huge spike in fire dragon activity and was very concerned about the implications. Aurene then showed me a vision that alluded to the reason.\n\nBraham had conferred with her previously. His connection to the Spirits of the Wild—and also his sensitivity to the Elder Dragons—had been growing. Owl\u0027s final words, \"...the Wild together can direct the fall,\" brought him to an epiphany. He would be the harness to influence the flow of magic to and from the fire dragon.\n\nThe whole idea sounded preposterous—and suicidal—but he\u0027d made up his mind, citing the Spirits who could insulate him from becoming fully corrupted as Primordus\u0027s champion. With that proclamation, he sought to confront the Elder Dragon in its lair. Aurene offered to let me see it firsthand via the scrying pool."
    },
    {
      "active": "Enter the scrying pool.",
      "complete": "I witnessed Braham\u0027s transformation with my own eyes; he conferred with Raven, Bear, Wolf, and Snow Leopard, who instructed him to make his way into the heart of the volcano. Had he not been protected with their magic, he would have burst into flames instantly. They placed their trust and confidence in the young norn, who was now ready to truly become the Norn of Prophecy as had been foretold. It would take their combined strength to not only keep him shielded from physical harm, but also protect him from the mental assault that only an Elder Dragon could mount against a mortal.\n\nHe journeyed downward into the hottest part of the volcano, conferring with the Spirits as he went. At the bottom, he faced a gigantic destroyer that threatened to end his journey then and there. But he prevailed, then turning to the Spirits for final guidance. They shared their intentions with him: Wolf would unite them, Snow Leopard would direct the dragon\u0027s hunger toward its sibling, Raven would provide clarity in Primordus\u0027s judgment to recognize its true enemy (as Jormag already was), and Bear would provide ferocity and fortitude to protect the Spirits from being consumed by the dragon\u0027s rage.\n\nWith that, Braham offered himself as the fire dragon\u0027s new champion. One of intellect, fortitude, and ferocity. It would take all of his will—and that of the Spirits—to retain even a shred of his self such that he could complete his mission, even if it meant his untimely death.\n\nI don\u0027t know if his plan will work, or if my friend is lost forever. If we lose him to the fire dragon—to this war—it can\u0027t be in vain."
    },
    {
      "active": "Travel to the Eye of the North and meet with Aurene.",
      "complete": ""
    }
  ],
  "id": 599
}