{
  "name": "Jormag\u0027s World",
  "level": 80,
  "story": 98,
  "goals": [
    {
      "active": "",
      "complete": ""
    },
    {
      "active": "Travel to Rata Sum, and meet with Taimi.",
      "complete": "I met Taimi back at Rata Sum, where Ryland and members of the Arcane Council were reviewing the latest dragon data. Oddly enough, with each passing conversation it feels like they view me as working on behalf of Primordus, whereas Ryland represents the interests of Jormag. Has everyone forgotten that both dragons need to be dealt with?\n\nThey freely share this information with both parties, though it\u0027s clear they are really only concerned with Primordus being taken off the table. Jormag has never really bothered asuran interests enough to shift their efforts. At this point, the fire dragon hasn\u0027t woken up. The \"feedback loop\" of magic between the Elder Dragon and its destroyers is creating a vicious cycle, all started with Kralkatorrik\u0027s death and the subsequent absorption of its magic. In Gorrik\u0027s words, \"Destroyers burn more, Primordus gets stronger, destroyers get more rabid. The effect is exponential.\"\n\nThe two Elder Dragons are polar opposites, and right now the power balance favors Primordus. In order to shift the balance the other way, we need to cut off Primordus from its magical source or possibly reverse it back to its destroyers. We need to starve the fire dragon or perhaps redirect its magic to the ice dragon. How we accomplish this is anybody\u0027s guess, but we\u0027re getting closer to understanding how all this fits together."
    },
    {
      "active": "Travel to the Eye of the North, and meet with Aurene.",
      "complete": "I returned to the Eye to chat with Aurene. We need answers, and Bangar\u0027s holding them back. Before I could finish my thought, we received a distress call from Crecia at Doric\u0027s Landing. She and Rytlock were assisting Logan when icebrood invaded, throwing the entire area into chaos. I need to help them."
    },
    {
      "active": "Protect Lake Doric",
      "complete": "We arrived to a terrifying scene. Icebrood had overrun the area outside Divinity\u0027s Reach, turning it into a frozen tundra. Refugees and soldiers were scattered about and needing assistance, so we did our best to round them up and get them to safety while thinning the enemy ranks.\n\nThe situation soon became clear: Svanir were rounding people up and encasing them in ice using a ritual. Not killing people outright, but instead \"preserving\" them for later. Turning them into Frozen—hardy warriors impervious to attacks from the opposite Elder Dragon.\n\nWe set about liberating two villages from ice dragon forces before it became crystal clear that Ryland had no interest in any sort of meaningful cease-fire. He just wanted to build Jormag\u0027s army and eliminate Primordus, thus creating a new world in Jormag\u0027s vision. Ryland would lead on behalf of his Elder Dragon. It seems obvious, and I called it from the very beginning, but I can\u0027t believe the Council chose to turn their backs and let something like this happen. I\u0027m disgusted."
    },
    {
      "active": "",
      "complete": ""
    },
    {
      "active": "Protect Snowden Drifts",
      "complete": "Braham contacted us, giving us intel on more ice dragon activity near kodan settlements. We headed there to assist. Kasmeer had beaten us by a few minutes, even going as far as rounding up reinforcements from our growing list of allies.\n\nThe kodan sanctuary was under siege by Ryland\u0027s Frost Legion. They\u0027d just scored a tenuous victory at Lake Doric, converting innocents into Frozen soldiers. What they were doing there was anybody\u0027s guess. All we knew was that it wouldn\u0027t be good.\n\nAfter helping evacuate the locals, we joined the kodan and headed toward Owl\u0027s shrine. Braham sensed immense pain from this Spirit of the Wild, and we needed to investigate. The entire area had been ravaged by Frost Legion, and the longer we waited, the more powerful Jormag would become.\n\nAt the shrine, Ryland was syphoning the magic from Owl, who had previously hid from Jormag\u0027s gaze. Ever since her reawakening at Braham\u0027s hand, she was now a target of the Elder Dragon and completely exposed. Rather than succumb to the ice dragon\u0027s advances, Owl chose to sacrifice herself to prevent a shifting of the balance. The other Spirits are still at risk of being corrupted, so we\u0027ll have to figure out a way to shield them from the dragon\u0027s might.\n\nAfter we dealt with his subordinates, Ryland slinked off the battlefield, claiming that this was a temporary setback. He taunted Braham and the rest of us by telling us to \"take the win\" because the next time we wouldn\u0027t be so lucky.\n\nThis barely feels like a win at all. Jormag, with Ryland\u0027s help, is gaining the upper hand and building a powerful army. We lost Owl, and now the remaining Spirits are at risk. And Braham is as confused as ever. His connection to both the Spirits and to Primordus\u0027s destroyers has him caught between two opposing sides. Perhaps he\u0027s the final piece of the puzzle, though. The one to help us clean up this mess."
    }
  ],
  "id": 605
}