{
  "name": "Jormag\u0027s Madness",
  "level": 80,
  "story": 98,
  "goals": [
    {
      "active": "Travel to the Eye of the North and meet with Aurene.",
      "complete": "I returned to the Eye and told Aurene and Taimi of Jormag\u0027s atrocities. The Arcane Council\u0027s commitment to \"helping\" with Primordus research had just given the ice dragon the upper hand, and it was costing lives. They had been trapping innocents in ice, preserving them for a future fight against the fire dragon. Aurene reached out to Jormag through their Voice—still caged nearby—in an attempt to stop the fighting.\n\nAurene\u0027s pleas were met with indifference as the ice dragon deflected all blame directly back. \"You refuse to help me stop the existential threat my brother poses. What choice, then, do I have but to shift the balance of power by whatever means I can?\"\n\nThe two Elder Dragons verbally sparred, each trying to convince the other of their position. Aurene was determined to stay out of Jormag\u0027s fight with their brother, Primordus. Jormag twisted Aurene\u0027s words against her in an attempt to guilt her into tipping the balance in Jormag\u0027s favor. It was an exhausting exchange that went nowhere, though I could tell both Aurene and Jormag weren\u0027t giving up.\n\nAccording to the prophecy, Jormag can only be defeated by their sibling. And Aurene was refusing to get involved for fear of creating collateral damage in upsetting the balance between the two. If we\u0027re going to take both Elder Dragons off the table, we\u0027d need to find another way.\n\nAfterward, Marjory contacted me with news of an icebrood and Frost Legion attack on Cathal, a sylvari village in Caledon Forest. To my surprise, Canach interrupted our comms with an offer to assist."
    },
    {
      "active": "",
      "complete": ""
    },
    {
      "active": "Protect Caledon Forest",
      "complete": "I arrived at the scene and met up with Canach, whom I hadn\u0027t spoken with in quite some time. We exchanged some small talk but quickly turned our attention to the situation at hand. Icebrood were harassing the locals, so we set about shoring up defenses and protecting those we could.\n\nTo my surprise, a tengu rushed over to seek our help. Frost creatures had turned their attention to the Dominion of Winds, their walled city in the distance (sometimes referred to as the \"Aerie\"). Canach was suspicious of the request, as the tengu were notoriously isolationist and had never offered to help anyone outside their compound. They verbally sparred throughout our journey toward the city gates, with Canach testing Kalidris\u0027s motivations with mild suspicion.\n\nThe battle culminated on a bridge outside the Aerie, where we faced a particularly nasty ice creature. It was a fierce battle, but we ultimately prevailed. Afterwards, Kalidris expressed gratitude for the support. She then offered to reciprocate in the future should we need aid. I\u0027m looking forward to learning more about her people."
    }
  ],
  "id": 608
}