{
  "name": "Your Kind of People",
  "level": 80,
  "story": 114,
  "goals": [
    {
      "active": "Investigate the Aetherblades.",
      "complete": "Note to self: however novel our communications tech is back home, Canthans find it laughably insecure. Rama was more than happy to demonstrate this by jumping into our call as we planned our Aetherblade investigation. But he also gave me permission to review the MinSec archives, which contained some useful information, so I won\u0027t hold it against him too much. (Taimi might.)\n\nI decided to search the downed Aetherblade flagship with Marjory and Gorrik. There, I found logs covering Mai Trin and her pirates\u0027 activities since their attack on Lion\u0027s Arch. Their time in the Mists sounds traumatic, to say the least—they had to kill Fractal echoes of themselves to rebuild their fleet, and then barely made it to Cantha after an encounter with Kralkatorrik. Ankka spoke of a restlessness in the crew—a desire to stop lying low and \"do something.\" Well, they\u0027re certainly doing something now.\n\nGorrik and Marjory managed to corner one of the \u0027Blades who had been working to repair the flagship\u0027s Mist-traversal tech. The pirate vaguely spoke of big changes and big plans, but was otherwise unhelpful. At least Gorrik was able to smash the traversal tech to pieces. The Aetherblades won\u0027t be escaping any time soon.\n\n***"
    },
    {
      "active": "Return to Aurene.",
      "complete": "Just then Taimi called, asking that I return to Aurene\u0027s cave immediately. The rest of our group was already there, along with—to my surprise—Lady Joon. Caithe and Aurene had become unresponsive, and no one knew why. Well, it didn\u0027t take me long for me to find out.\n\nAs I approached Aurene, I felt as if my spirit was pulled into another world. A place like the bottom of the ocean, but also not—at the time, I wondered if it was real. It was then that I heard it: the voice of the final Elder Dragon, Soo-Won. Just...calmly talking to Aurene.\n\nAs abruptly as it began, it ended, and we were back in the real world. It was then I learned Soo-Won is not only the final Elder Dragon, but the original Elder Dragon—the \"Mother\" Kralkatorrik referred to all those years ago. She\u0027s been in Cantha the whole time—and according to Joon, she\u0027s been protecting the people here! Soo-Won says she wants Aurene to take her place and become the only Elder Dragon, just as Soo-Won once was. To be honest, I\u0027m still not sure how I feel about it all. Or if I can trust her.\n\nThe revelations didn\u0027t end with the dragons. As we turned our attention back to the Aetherblades, Joon confessed that she was the one who had hired them! Joon had recruited Mai Trin years ago, not knowing the pirate\u0027s history, and thought she could do good. Well, we see how that turned out—Joon\u0027s request for research from outside Cantha turned into a kidnapping. Joon gave us an approximate location to track down Mai Trin—Zen Daijun—and Jory and Gorrik went ahead to scout the area. It\u0027s time to make Mai Trin pay for her crimes."
    }
  ],
  "id": 614
}