{
  "name": "The Future in Jade",
  "level": 80,
  "story": 111,
  "goals": [
    {
      "active": "Go to the Xunlai Jade Power Plant.",
      "complete": "As we planned our next course of action over comms, it became clear there was some bad history between Mai Trin and Yao. Yao seemed to resent Mai for being chosen as Joon\u0027s protégé, believing themselves to be much more qualified.\n\nI acquired the power plant\u0027s passcode from the lead engineer and, after I acclimated myself to my jade bot\u0027s many uses and functions, we were ready to investigate the city\u0027s energy infrastructure. Mai apologized to Yao for the past enmity between them. She\u0027ll be doing a lot of apologizing to people from now on, I think.\n\n***"
    },
    {
      "active": "Investigate the Xunlai Jade Power Plant.",
      "complete": "Taimi finally managed to encrypt our comms network, just as we started poking around the power plant. According to her, Joon had always been tight-lipped when it came to the exact details of charging jade batteries. If we wanted a better understanding of how they worked, it was all on us. I picked up an energy scanner and began sending data samples for Taimi to analyze.\n\nA power spike complicated the data collection process, because of course it did. A simple, straightforward task with zero wrinkles would be boring. As we reset junction boxes and scanned batteries, Mai noted that these jade tech malfunctions didn\u0027t seem like Ankka\u0027s style. She was all about carrying out Scarlet\u0027s ideals of \"democratization through chaos,\" and corporate sabotage didn\u0027t really align with that.\n\nTaimi compiled all of the data, and her analysis yielded a truly shocking discovery. \n\nJade tech is powered by dragon magic.\n\n***"
    },
    {
      "active": "Get access to the other lab.",
      "complete": "Taimi patched Yao into our comms frequency, reported our findings, and requested access to Nahpui Lab. We needed to build a broader data set immediately. Unfortunately, according to Yao, the power spikes from earlier scrambled Nahpui\u0027s security system, so it was a no-go until they came back online.\n\nFortunately, we didn\u0027t have to wait for that. Mai Trin had just the thing we needed (buried in her messy apartment): an imperial security badge. With it, we could bypass Kaineng lab security, even during a blackout.\n\nShe solemnly reflected on the badge being the only tangible proof of the trust Joon once afforded her.\n\n***"
    },
    {
      "active": "Investigate Nahpui Lab.",
      "complete": "Mai, Marjory, and I met up with Gorrik at Nahpui Lab. Taimi had told him everything. If jade tech\u0027s power cells were in fact using dragon magic, that would explain how they\u0027re being corrupted. We needed to scan more batteries. Now that Taimi knew what to look for, she could try isolating the energy signature to paint a clearer picture of what exactly we were dealing with. Mai Trin reiterated her doubts that Ankka was involved with whatever was happening to all the jade tech and batteries. There was no evidence that implicated her as the one responsible.\n\nTaimi ran her scans on our newly collected data and the results were even more earth-shattering than the last. Not only were the batteries powered by dragon magic, but Joon had somehow cracked the mystery of producing pure dragon magic.\n\nSuddenly, an ambush! The Aetherblades had broken through security and were blitzing the lab...but Ankka wasn\u0027t with them. This was a distraction. I told Taimi to find Joon immediately.\n\nAfter the battle, we called Joon and confronted her. But before we could really grill her, Aurene chimed in. Apparently jade power wasn\u0027t solely Joon\u0027s idea—Soo-Won is being held in a top-secret facility, and she\u0027s allegedly cooperating with her on the whole endeavor to boot. That\u0027s why Ankka sent the distraction: she knew about Soo-Won somehow! Joon thought it prudent that we all meet face-to-face and told everyone to rendezvous with her at the reactor. I suggested Aurene hang back, in case Ankka showed up with the Extractor."
    }
  ],
  "id": 616
}