{
  "name": "The Cycle, Reborn",
  "level": 80,
  "story": 108,
  "goals": [
    {
      "active": "",
      "complete": ""
    },
    {
      "active": "Gather your thoughts and regroup at Arborstone.",
      "complete": "We reunited back at Arborstone to reflect on the loss of Soo-Won and what it means for the Dragon Cycle to be over. We expect that Aurene will be able to take the place of the lost Elder Dragons and provide the stability that Tyria\u0027s magic craves, but if I\u0027ve learned anything from the last ten years, it\u0027s that Tyria never behaves like you expect. Best to expect nothing and be prepared for anything. But maybe, finally, we will get a break.\n\nWe\u0027re all still feeling Soo-Won\u0027s loss, and that won\u0027t change soon, but most of my friends seemed optimistic about what\u0027s to come. Cantha faces a great challenge in replacing Soo-Won as the source of their jade power, but Joon, Taimi, Yao, and the country\u0027s many other great minds are already on the problem. Kasmeer and the rest of our politically minded friends will be keeping busy negotiating new alliances, as all those conversations basically ground to a halt—what with the world-ending peril taking priority.\n\nThere also seems to be an emerging new private detective agency made up of Rama, Marjory, and—remarkably—Ivan and Gorrik. For the rest of us so used to chasing dragons, our own futures are not so clear. What happens to the dragon watcher when there are none left to watch? I suppose we\u0027re going to find out.\n\n***"
    },
    {
      "active": "Travel to Divinity\u0027s Reach.",
      "complete": ""
    },
    {
      "active": "Read the message from Kasmeer.",
      "complete": "After a couple of months of relative quiet, I received a message from Kasmeer inviting me to attend a party being thrown by her and Marjory at the Dead End Bar. It seemed like a good opportunity to reconnect with friends and see how everyone had settled into the Age of Aurene.\n\n***"
    },
    {
      "active": "Attend Marjory and Kasmeer\u0027s gathering.",
      "complete": "I arrived at the bar to find that about half the party was already there, so we mingled until everyone showed up. Kasmeer and Marjory seemed to be bubbling over with excitement, and it was clear that something big was going to happen. When our full party had gathered—Taimi, Gorrik, Logan, Rox, Rytlock, Canach, and Braham—they stood in front of all of us and proposed to each other! I think most of us weren\u0027t surprised, but that didn\u0027t make it any less exciting.\n\nAs I looked around, I thought about how good it was to see everyone be able to do the sort of normal things we\u0027ve all been missing out on for so long. Life\u0027s moving on. The guild is moving on. I suppose maybe I\u0027ll have to move on some day too. But to what? I don\u0027t know yet. I suppose I\u0027ll find out when I get there."
    }
  ],
  "id": 617
}