{
  "name": "Can\u0027t Trust a Pirate",
  "level": 80,
  "story": 113,
  "goals": [
    {
      "active": "Find Mai Trin.",
      "complete": "I met up with Gorrik and Marjory in Zen Daijun. They\u0027d both picked up strange ultrasonic frequencies emanating from the area and were investigating them—suspecting they might be linked to the Aetherblades somehow. Their suspicions ended up being correct. The cave was hiding a secret entrance to an Aetherblade hideout! I contacted Taimi to report our findings, and Joon, overhearing us, immediately began making a beeline to our location. She was itching for the chance to finally bring Mai Trin to justice, and honestly, I can\u0027t say I blamed her...\n\nWe explored the den and encountered Ivan, who remained loyal to Mai Trin and refused to tell us her whereabouts. He insisted that things aren\u0027t as they seem and begged us not to hurt Mai Trin. After a quick scuffle, we overpowered him."
    },
    {
      "active": "Capture Mai Trin.",
      "complete": "Eventually we stumbled upon Mai Trin. Well, actually...she did the stumbling. She was very drunk. Joon and Kasmeer arrived, and we tried grilling the captain about her plans, but talks immediately broke down. To our shock, Mai Trin began channeling the power of the Mists, like a revenant! And even worse, she called upon the power of our old foe—Scarlet Briar!\n\nNaturally, Scarlet\u0027s echo was much too strong (and crazy) for Mai Trin to handle, and she began running wild—leading to a desperate struggle that we all barely survived."
    },
    {
      "active": "Interrogate Mai Trin.",
      "complete": "With Scarlet\u0027s echo brought back under control, we apprehended Mai Trin and relieved her of her weapons. She was still overwhelmed by the voices from the Mists and having trouble tuning them out, so Kasmeer suggested dampening her sense of sight to help her focus—not unlike Rytlock. After fashioning a makeshift blindfold for her, we demanded that Mai Trin divulge her orders to the Aetherblades. Not only did she reveal they\u0027re planning to attack a jade processing facility, but also they\u0027re no longer under her command. Apparently Ankka staged a mutiny and took all of her ships and crew.\n\nWe doubled back and untied Ivan—Trin was genuinely surprised he hadn\u0027t abandoned her. He suggested that we locate Ankka using the ships\u0027 transponders. A solid idea, but unfortunately Renyak seemingly damaged the transponders, resulting in the tracking data being imprecise. All we could glean was that we needed to go to New Kaineng. Not a lot to work with, but it was something. Mai Trin offered to help us in our hunt (perhaps out of guilt). We begrudgingly accepted, though Joon didn\u0027t seem too thrilled about it. Before departing for New Kaineng, it was decided that I should secure a permit from the Ministry of Transit first...lest I be arrested for violating travel laws."
    }
  ],
  "id": 620
}