{
  "name": "Weight of the World",
  "level": 80,
  "story": 107,
  "goals": [
    {
      "active": "Reach Joon\u0027s estate.",
      "complete": "On my way to Joon\u0027s estate, I was unexpectedly pulled back into Soo-Won\u0027s mind. We were able to a have a brief conversation, in which she stressed that when the time comes, we will have to kill her. But then everything changed. Her mind was filled with monsters, and she began to speak in the voice of the Void. It warned me of its inevitability—and then its minions attacked me. Thankfully, Caithe and Aurene arrived to help. They managed to hold the Void off long enough for me to escape. I had no choice but to leave them behind.\n\nThis meeting had better go as we hope. We\u0027re running out of time, and without Joon, there is no way we can reconstruct the Extractor in time.\n\n***"
    },
    {
      "active": "",
      "complete": ""
    },
    {
      "active": "Reach Joon.",
      "complete": "I met Kasmeer outside Joon\u0027s estate, and then Taimi let us past the gate—in opposition with Joon\u0027s wishes, as we were about to find out. As we entered her estate, she appeared overhead, but not to negotiate—only to kick us out. She still blamed us for what happened at the reactor and refused to believe we were planning to do anything but further damage her life\u0027s work. After a brief exchange, she left, turning the mansion\u0027s security on us.\n\nWe searched the mansion for the means to disable that security, learning more about her along the way—from her humble beginnings, to her many awards, to her role as a mother. A portrait of Joon emerged. Hopefully that greater understanding will help us finally say the right thing to convince her to return to our side.\n\n***"
    },
    {
      "active": "Explore the mansion\u0027s second floor.",
      "complete": "Armed with this new understanding of Joon, we pushed on to the workshop, finally managing to gain access to her innermost sanctum.\n\n***"
    },
    {
      "active": "Appeal to Joon.",
      "complete": "When we reached Joon\u0027s lab, she had just received the news about Minister Li\u0027s arrest and his general involvement in recent events. That, combined with the piece of Ankka\u0027s Extractor, convinced her we had nothing to do with her reactor melting down. We hoped that would be enough, and that we would be able to move forward at that point.\n\nHowever, when it came time to discuss solutions, she refused to discuss any course of action that did not result in Soo-Won returning to the reactor, fearing the fallout that a lack of jade power would cause in Cantha, and we once again clashed. Fortunately, Taimi was finally able to reach her, reassuring her that we understood what her work means to Cantha, and that we were fully committed to and capable of finding a solution together. After she finally stood down, she and Taimi immediately began work on restoring the extractors."
    }
  ],
  "id": 621
}