{
  "name": "Empty",
  "level": 80,
  "story": 99,
  "goals": [
    {
      "active": "Lure out Ankka.",
      "complete": "With Canach and Sayida\u0027s airship out in the open, it didn\u0027t take long for the Aetherblades to track us down. Cornering us with their own ships, they sent wave after wave of pirates to try to take it. Luckily, Ayumi had planned ahead: Kestrel snipers, hidden among the trees, got a drop on the \u0027Blades and took most of them out.\n\nWe isolated one of the Aetherblade lieutenants, and he was \"willing\" to spill everything we needed to know about Ankka\u0027s location. But before he could, Ankka turned all the fallen pirates into undead thralls. They descended on us, killing the lieutenant and overwhelming the Kestrels.\n\nThe good news is that once we cleared our airship of the dead, Gorrik was able to pinpoint the location of the Extractor—in the center of the Xunlai Jade Junkyard. We\u0027re on our way to it now.\n\n***"
    },
    {
      "active": "Confront Ankka.",
      "complete": "The route to the junkyard was a twisted echo of Orr: littered with the bodies of fallen Kestrels and patrolled by Aetherblades who had been reduced to mindless Risen—a fate I wouldn\u0027t wish on my worst enemies. And there, waiting in the center of all that decay, was Ankka.\n\nAnkka threw every horrifying trick she had at us, even unleashing Void energy from the nearby corrupted jade. As we fought, she made it clear she believes we\u0027re responsible for all this chaos—for the Void itself. That it\u0027s the natural end point of all our meddling and our hubris. I...can\u0027t say she\u0027s wrong. But her idea that we need to just accept the inevitable and let the world reset? I will never stand for that.\n\nAnkka was defiant to her last breath, but that breath finally came. The Extractor is ours.\n\n***"
    },
    {
      "active": "Retrieve the Extractor.",
      "complete": "Or not. But...I\u0027m getting ahead of myself.\n\nGorrik needed a moment to process Ankka\u0027s death—he\u0027s never experienced the hurt of betrayal like that before, and her death hadn\u0027t brought him the closure he sought. I told him only he could choose to heal that wound. He took my advice to heart—I\u0027m proud of him, to be honest—and got to work analyzing the Extractor.\n\nBut Ankka had sabotaged it. Of course she had sabotaged it. The Extractor overloaded as soon as we activated it—sending us flying and leaving only wreckage behind. We\u0027re lucky no one was killed, but our plan of using the machine to purge Soo-Won\u0027s corruption is shot, and we\u0027re running out of time.\n\nWe have one hope left. We managed to recover a single piece of the Extractor—nothing that will work on its own, but solid evidence that Ankka was behind everything. With any luck, we can use that evidence to regain the trust of the Ministry of Security—and Joon—rebuild the device, and stop the Void before it\u0027s too late.\n\nIt\u0027s a long shot. But it\u0027s our last shot."
    }
  ],
  "id": 623
}