{
  "name": "The Only One",
  "level": 80,
  "story": 100,
  "goals": [
    {
      "active": "Purge the Void.",
      "complete": "We successfully brought Soo-Won to the Harvest Temple and used the extractors to remove the Void from her body. Unfortunately, once the corrupted magic was out, it coalesced to form its own being and attacked us with its army. The Void\u0027s initial appearance created a shock wave that took the extractors off-line, but Taimi proposed that we could use them to contain some of the Void\u0027s power—provided we could get them back online.\n\nAs our other allies scattered to retake the outlying extractors from the Void\u0027s army, Kuunavang and I stayed to defend Taimi and Joon while they restored the primary extractor. The Void\u0027s forces overwhelmed us, and Kuunavang and I were momentarily overcome. Thankfully, Aurene pulled me from the jaws of death and infused me with some of her own power, which she instructed me to use to face the Void head-on. She didn\u0027t exaggerate its effectiveness—as I rejoined the battle, I somehow used a wave of her power to clear the entire main platform.\n\n***"
    },
    {
      "active": "Defeat the Dragonvoid.",
      "complete": "I moved on to help my allies retake the outlying extractors, facing a distinct Void manifestation on each Elder Dragon platform. Gorrik, Rama, and I defeated the manifestation of Jormag first, and then I moved on to help Canach and Sayida defeat Primordus. Then Ayumi, Ivan, and I vanquished Kralkatorrik. Again.\n\nAround us, the threat of the Void rapidly went global. Calls from our allies around the world revealed the extent to which it had upended Hoelbrak, the Black Citadel, the Sandswept Isles, and more. Though we\u0027d hoped to prevent that, hearing the voices of so many old friends fighting alongside us in their own parts of the world rallied my spirits.\n\n***"
    },
    {
      "active": "Defeat the Dragonvoid.",
      "complete": "After Kralkatorrik, I found Marjory fending off the shade of Mordremoth from Kasmeer\u0027s fallen body. Kas was alive, thankfully, just unconscious from giving too much of herself to get us here. When the shade was defeated, the two shared a tender moment, a celebration of still being alive.\n\nCaithe and Logan stood at death\u0027s door in front of the final fallen dragon echo—Zhaitan. Together, we defeated the death dealer again, though Logan was wounded in the process. He convinced us to press on without him, as it was time to confront the Dragonvoid itself.\n\n***"
    },
    {
      "active": "Defeat the Dragonvoid.",
      "complete": "The Dragonvoid was so certain of its inevitability. But as Aurene reminded me, nothing is inevitable. Not even the Dragon Cycle. And in the end, we defeated it, ripping its tendrils out of Tyria and restoring the world to harmony.\n\n***"
    },
    {
      "active": "Bring the Dragon Cycle to an end.",
      "complete": "With the Dragonvoid defeated, we had only one thing left to do—say good-bye to Soo-Won and finally bring an end to the Dragon Cycle. As Aurene absorbed the last of her magic, Soo-Won dissipated in a beautiful display. In that moment, it felt like the Dragon Cycle was truly over, and a new age had begun—the Age of Aurene.\n\nSeeing Aurene step into her new role was bittersweet. I know that a chapter of our relationship has come to an end. She isn\u0027t going to need me in the same way anymore and will likely become inaccessible in some ways. I will have to get used to that, and I know it\u0027s a good thing, but I will also miss what we had."
    }
  ],
  "id": 627
}