{
  "name": "Old Friends",
  "level": 80,
  "story": 101,
  "goals": [
    {
      "active": "Attend Gorrik\u0027s reunion.",
      "complete": "I made my way to Lornar\u0027s Pass, where Gorrik and I met his \"friend\" Ankka together. Gorrik said his former colleague had important dragon research to share. Ankka was initially affable, even—dare I say—charming? Gorrik can have trouble expressing his emotions, but he was genuinely happy to see his old friend. However, Ankka\u0027s disposition turned dark when Gorrik brought up the topic of dragons.\n\nShe suddenly revealed herself to be an Aetherblade and snatched Gorrik right in front of me. I should\u0027ve seen it coming! Aurene and I will be going after the Aetherblade fleet together. I have my concerns over Aurene\u0027s direct involvement, given the event singularity we discussed, but retrieving Gorrik safely is the top priority right now.\n\n***"
    },
    {
      "active": "Rescue Gorrik!",
      "complete": "The Aetherblades are back. I boarded one of their ships as Aurene and I split up to search for Gorrik. The fleet entered a portal into the Mists; where they\u0027re heading, I can\u0027t say. It seems the \u0027Blades have a bone to pick with me after our confrontation in the fractals. I briefly encountered Captain Mai Trin herself, but she fled when Aurene appeared. An Aetherblade lured me into an ambush, but I fought my way out. Wherever they\u0027re keeping Gorrik, I\u0027ll find him.\n\n***"
    },
    {
      "active": "Rescue Gorrik!",
      "complete": "The fleet exited the Mists to somewhere unknown. Somewhere outside of Taimi\u0027s comms range. I found Gorrik at last, tied up and in the process of being questioned. Ankka bombarded our ship with cannon fire, so we fled to the ship\u0027s deck. We almost escaped with Aurene, but she was hit by a new Aetherblade weapon. The ship went down as Aurene fell from the sky and...my memory is hazy. I\u0027m in a bad way, washed up on a beach somewhere; recording this in case anyone from Dragon\u0027s Watch finds it. My eyes feel heavy...I need to rest...\n\n***"
    },
    {
      "active": "Get your bearings.",
      "complete": "I awoke in a jail cell with Gorrik, attached to some kind of machine that seemed as advanced as asuran technology—maybe even more so. Gorrik was elated to see me, but he had a bit of an anxiety meltdown—I feel bad I\u0027d been unable to keep him company due to my, well, lack of consciousness. Before he could elucidate where we were, a detective by the name of Rama let us out. He made us fill out some paperwork and returned my equipment before dropping a bombshell: we had landed in Cantha, the human empire that sealed itself off from the world long before I was even born.\n\nI could barely wrap my head around it as I followed Rama to a courtyard. Marjory and Kasmeer were waiting for us—what a feeling to see friends at a time like this! Kasmeer—now a Krytan ambassador—explained that Cantha reopened its borders after our ship went down. She assured me that Aurene was okay and I would see her soon.\n\nBefore I could be officially released, I spoke with the Canthan Minister of Security, Li. He was polite, but there was distrust in his voice. I don\u0027t blame the Canthans for their caution. There\u0027s a lot to catch up on, and I\u0027m eager to explore Shing Jea—a place that, up until now, might as well have been legend."
    }
  ],
  "id": 629
}