{
  "name": "Fallout",
  "level": 80,
  "story": 106,
  "goals": [
    {
      "active": "Determine a new course of action.",
      "complete": "Having escaped from the Yong reactor, we all went our separate ways to help us evade capture. It seems we are being blamed for what Ankka did, and with Soo-Won on the loose, there\u0027s no time to stop and explain what happened.\n\nAurene set off on Soo-Won\u0027s trail with Caithe while I received a message from Navan hinting the empress is on our side—or at least hasn\u0027t made up her mind yet. Navan suggested we meet at a local sushi restaurant to discuss the situation further, so I will now meet her at \"Nika\u0027s Blade\" to see what she has to say. Hopefully the food is good.\n\n***"
    },
    {
      "active": "Meet with Navan to discuss the situation.",
      "complete": "When I arrived at the sushi restaurant, I found that Detective Rama had crashed our meeting. He was following orders from the Ministry of Security to bring us in for questioning, but Navan, acting as an extension of the empress, overrode those orders.\n\nNavan suggested we retreat to a place of refuge in the Echovald Forest. Before we could finish our meeting, however, Captain Fa, Joon\u0027s head of security, arrived to take me into custody. I convinced Fa to let us go—for now—and Rama was similarly moved to let us prove our innocence. Not one to be left out of the action, however, he decided to come along, with the subtle threat that if he found any reason to think he\u0027d been deceived, it would be back into a Shing Jea cellblock with me.\n\n***"
    },
    {
      "active": "Secure the safe haven.",
      "complete": "I reconnected with my allies at Navan\u0027s haven—a ruin called Arborstone, which once belonged to a Kurzick noble house known as the zu Heltzers. It was destroyed when they were wiped out by the Ministry of Purity many years ago but has been gradually restored since. It seems our detective is part Kurzick himself, and so the sight of the ruined great house was deeply affecting. The traumas left by the Ministry of Purity\u0027s actions still run deep in the people of Cantha.\n\nOn our way into the building, we were attacked by mysterious, shadowy creatures of unknown origin. Navan expected to find other travelers seeking refuge in Arborstone, as well as a guardian named Ishan, but instead all we found was death, destruction, and that same shadowy magic, which seems to alter the very rules of reality. The ways in which it killed the travelers were all deeply unsettling. Even with all the horrors we\u0027ve seen, it shook the whole party. We are still looking for Ishan, but our hopes for finding Navan\u0027s friend in a suitable condition are growing thin.\n\n***"
    },
    {
      "active": "Secure Arborstone.",
      "complete": "We eventually found Ishan, but unfortunately he had been consumed by the same corrupting power, which we now know is called \"the Void.\" Ishan was a saltspray dragon, and as it turns out, so is Navan—known as Kuunavang in her dragon form. After spending some time corrupted by Shiro Tagachi, she became a hero to the Canthan people, and ever since then she has remained in human form to continue to watch over them.\n\nKuunavang has been a longtime ally of Soo-Won and is now aiding us in our efforts to prevent the Void from consuming the Elder Dragon and spreading to the rest of Tyria. Joon\u0027s reactor had been working to stabilize Soo-Won by siphoning off corrupted magic, and our scientific minds think it is possible Ankka\u0027s Extractor could do the same. Ayumi of the Kestrels—a group of rangers tasked with protecting Echovald—offered to help us track down Ankka, who was last seen somewhere in the Echovald Wilds. They seem trustworthy enough."
    }
  ],
  "id": 630
}