{
  "name": "Deepest Secrets",
  "level": 80,
  "story": 103,
  "goals": [
    {
      "active": "Explore the Yong Reactor.",
      "complete": "From the moment I stepped off the elevator, it was clear that Joon has invested an incredible amount of her wealth into the Yong Reactor, where she is housing the Elder Dragon Soo-Won. Despite her obvious pride in having built such a magnificent facility so far below the water\u0027s surface, the good Lady Joon couldn\u0027t be bothered to meet us there in person, instead showing us around via holographic projection. Joon assured us that her arrangement with Soo-Won was mutually beneficial and collaborative, a fact that I am still finding difficult to believe. Still, we\u0027re here, and we are preparing to see this arrangement for ourselves. I have to wonder: What is Soo-Won really like?\n\n***"
    },
    {
      "active": "Locate Soo-Won in the Yong Reactor.",
      "complete": "Walking among the towering pillars of jade batteries up close was breathtaking. As we neared the access point to Soo-Won\u0027s chamber, we overheard Lady Joon once more arguing with Minister Li via hologram, but the hostile nature of their dynamic was nothing compared to what happened next. As Joon went to open the access point for us, the many jade mechs that comprised the facility\u0027s autonomous security turned on us!\n\nIt was Mai Trin, of all people, who stepped in and \"hacked\" the security system, shutting down the mechs. There was no doubt now that Ankka was also inside the facility\u0027s network, making our goal of finding Soo-Won even more urgent. Unfortunately, the compromised security locked down the main access point and cut off our contact with Joon, so we\u0027re heading for an alternate entrance via the maintenance corridors.\n\n***"
    },
    {
      "active": "Speak with Soo-Won.",
      "complete": "After navigating the maintenance area through a series of energy shields using my handy jade bot, we were confronted suddenly by Ankka! Or rather, by a holographic projection of her. She taunted Mai Trin and Gorrik before disappearing again, but not before making it clear she was deeper in the facility than we were.\n\nWe bypassed the last of Joon\u0027s security, but the moment that Soo-Won was within sight I was pulled, again, into her mind. There, Soo-Won confirmed that she had sought out Joon and her technology to help her channel the magic of Tyria after the deaths of her children, the other Elder Dragons. In short: Soo-Won and this facility had been the only thing keeping the world together as the dragons died. She painted a grim picture but left me with the slim hope that Aurene could manage a new cycle, if we can prepare her to withstand the tidal wave of energy that Soo-Won\u0027s death would release.\n\nMy time with Soo-Won was cut short as I was pulled from her mind to discover Ankka confronting the Elder Dragon. Before any of us could react, Ankka unleashed the Extractor and filled the chamber with the raw power of Aurene\u0027s Brand magic! As the chamber filled with crystals and her harness was destroyed, Soo-Won was released, and we were forced to flee, with the chamber falling apart and the ocean pouring in.\n\n***"
    },
    {
      "active": "Avert the crisis in the control center!",
      "complete": "As we made our way up from the chaos of Soo-Won\u0027s crumbling chamber, we learned that the combination of Aurene\u0027s uncontrolled magic and Soo-Won\u0027s explosive escape had sent the reactor into meltdown. It was up to us to fix it before the reactor exploded and took all of New Kaineng with it. But Ankka was determined to stop us, first sending her Aetherblades, then unleashing another surprise: that her own experiments with dragon magic allowed her to tap into Zhaitan\u0027s power, reviving the fallen Xunlai workers to tear us down.\n\nWith dozens of undead rising all around us, we located the control room and gained access. Mai Trin sealed herself in, preventing us from intervening as she went to stop the reactor from exploding. Marjory, Gorrik, and I fled the control center, only to witness the shocking scene as Ankka killed her former captain in cold blood—but not before Mai Trin was able to stop the reactor from catastrophic failure. Whoever she was before, Mai Trin sacrificed her life to save a city, and save us.\n\nWe arrived back in the lobby of the Yong Reactor and were greeted by the commanding voice of Captain Fa, the head of Xunlai Security, over the announcement system, and it did not sound as though there would be time or opportunity for us to establish our innocence. With Soo-Won loose out there, and her dire warnings about what would happen to Aurene if Ankka\u0027s plan came to fruition, we opted to make our way out of the facility in the emergency escape pods, quickly returning to the surface. I only hope that there\u0027s enough time for us to get to Soo-Won and stop all of this before the worst happens."
    }
  ],
  "id": 632
}