{
  "name": "To Catch a Spider",
  "level": 80,
  "story": 102,
  "goals": [
    {
      "active": "Devise a plan to locate Ankka.",
      "complete": "If tracking down Ankka wasn\u0027t our top priority before, it sure as hell is now. Her Extractor might be the only way to pacify Soo-Won. We need to find her.\n\nThe Kestrels provided us with two leads: The first was a piece of Aetherblade tech they\u0027d found in Echovald. The second was intel on Ankka\u0027s movements.\n\nGorrik believed the tech to be one of the airship transponders damaged by Renyak. With some time, he might be able to use it to help us. As for Ankka\u0027s movements, according to Ayumi, she\u0027d been sending Aetherblades to talk with both the Speakers and the Jade Brotherhood. What is she planning? I have to know.\n\n***"
    },
    {
      "active": "Work with the Kestrels to get information on Ankka.",
      "complete": "While Aurene and Caithe worked to keep Soo-Won within the Jade Sea, the Kestrels helped me infiltrate the gang camps to learn more about Ankka\u0027s dealings. Apparently, she\u0027d been negotiating with both sides before abruptly backing out. Why?\n\nAll became clear when we located the Aetherblades\u0027 camp. Ankka was long gone, but her audio logs remained. As it turned out, she was trying to build a Mist portal device, and both the Speakers and Brotherhood possessed parts that she needed. The reason she backed out of talks with them? Reports of a new Aetherblade airship that just arrived in the area—complete with a working portal device, according to their scans. Ankka no longer needed to build her own.\n\nUsing the newly repaired transponder, Gorrik was able to trace the airship\u0027s signal to Melandru\u0027s Hope. We need to beat Ankka there at all costs.\n\n***"
    },
    {
      "active": "Cut off Ankka\u0027s avenue of escape.",
      "complete": "After some searching, we located the ship in a well-hidden cavern. Its owners—our old friends, Canach and Sayida! They\u0027ve come to Cantha to start a new business venture: a social club / gourmet restaurant. I apprised them of our current situation with Ankka and offered them a proposal: let us use their ship as bait to draw Ankka out and, in return, we\u0027ll help them with the setup of their establishment.\n\nWe had an accord. The best place to lure Ankka is the Xunlai Jade Junkyard, at the center of Echovald. No bystanders will get caught in the crossfire there. Ivan, who has now pledged himself to our cause, sent out a false message to the Aetherblades\u0027 comms network.\n\nThis entire time, Ankka has been one step ahead of us. But not anymore. Our trap is set."
    }
  ],
  "id": 633
}