{
  "name": "In the Name of the Law",
  "level": 80,
  "story": 109,
  "goals": [
    {
      "active": "Set up a meeting with Minister Li.",
      "complete": "With newfound evidence proving my innocence, I met Rama at the East Precinct office with hopes of appealing to Li. Unfortunately, my plan was derailed, both by Li\u0027s absence and a less than cooperative precinct employee. After helping the precinct with some fieldwork on the streets of Kaineng, Rama\u0027s lifelong friend (and perhaps more?) Captain Min put us in touch with the Minister. Rama and I are back on track to speak with Li and put this misunderstanding to bed. The whole ordeal has made me increasingly grateful for those especially kindhearted citizens of Cantha, like Min and Rama. It\u0027s also made me very thankful my only work drama is dragon related.\n\n***"
    },
    {
      "active": "Present proof of your innocence to the Ministry of Security.",
      "complete": "At the Ministry of Security, Rama and I met with Li in an attempt to convince him of my innocence. I suspect that Li may be the only person in Cantha able to rattle Rama\u0027s cool composure. After presenting him with the evidence of Ankka\u0027s culpability, it seems Li has finally acknowledged the truth. More importantly, he\u0027s agreed to transport us to Joon\u0027s mansion so we can plead for her help with containing the Soo-Won situation. For the first time in recent events, I feel hopeful for what is to come.\n\n***"
    },
    {
      "active": "Meet on the roof.",
      "complete": "I should\u0027ve known better than to be overly optimistic. Upon reaching the MinSec rooftop to board our \"transport\" to Joon, Li ordered his Elite Guard to ambush me. Much to Li\u0027s outrage, Rama refused to allow this injustice to take place, and the two off us fought side-by-side to fend off the guards. The situation became even graver when Captain Min arrived with some devastating news: Li was, in fact, a covert leader of the Purists. With the help of some quick thinking from Captain Min, Rama and I were able to take down the (not-so) Elite Guard and detain Li for his crimes.\n\nI\u0027m incredibly grateful for the courage and kindness Rama showed me, but I worry about his well-being, knowing that Li was his longtime mentor. I do feel a bit better knowing that he will be in the capable company of Captain Min during Li\u0027s detention process. Now, with one destructive force contained, I make my way to Joon\u0027s mansion to ask for her help in vanquishing another."
    }
  ],
  "id": 634
}