{
  "name": "New Friends, New Enemies",
  "level": 80,
  "story": 115,
  "goals": [
    {
      "active": "",
      "complete": ""
    },
    {
      "active": "Read the urgent letter.",
      "complete": ""
    },
    {
      "active": "Meet with Rytlock at the Black Citadel Imperator\u0027s Core to discuss the Molten Alliance threat.",
      "complete": "I was asked to meet with Rytlock at the Black Citadel—walked right into a full-on war council. There\u0027ve been attacks all over the southern Shiverpeaks, dredge and Flame Legion working together. They\u0027re calling themselves the \"Molten Alliance,\" and the casualties are starting to stack up.\n\nOn my way inside, I ran into Rytlock consulting with a charr named Rox. She\u0027s trying out for his warband, so Rytlock\u0027s putting her through her paces. He ordered her to retake the recently captured North Nolan Hatchery from the Alliance. I volunteered to tag along, see if I can get a better grasp of the situation."
    },
    {
      "active": "Meet with Rytlock in his office.",
      "complete": "I went straight to Rytlock\u0027s office after the quorum. If the stakes weren\u0027t high enough, Rytlock was already at odds with another unfamiliar face: Braham Eirsson. His village was being threatened by the Molten Alliance. Rytlock rejected his request, despite their desperate need for reinforcements. The Legions are overwhelmed and Smodur can\u0027t spare the troops. Braham claimed to be Eir Stegalkin\u0027s son in an attempt to curry our favor, but it didn\u0027t work on Rytlock or me. Hopefully he\u0027ll get some better news after speaking with Knut Whitebear."
    },
    {
      "active": "Meet up with Rox and defend North Nolan Hatchery from the Molten Alliance.",
      "complete": "The air was already thick with smoke by the time Rox and I arrived at the hatchery. The Alliance was using some sort of sonic emitters to incapacitate the devourers—the sound was miserable. Fortunately with a couple good whacks, they were out of commission. But if that was just a taste of the weapons they\u0027re fusing... The dredge and Flame Legion are going to be a far more destructive team than we imagined.\n\nAfter we destroyed the emitters and rescued Sithio Quicklash, Sithio gave us a key to travel further into the facility. We put down one of the Alliance leaders inside, a dredge named Marat. With Marat down, the attack was quelled and we were able to reclaim the hatchery. Though the reason for these attacks is still foggy, we do know that they Molten Alliance is taking prisoners... Where and for what purpose? That\u0027s for us to find out.\n\nIn lighter news, Rox found a new friend. One of the lone devourers at the hatchery started following her like a lost puppy. She tried to shoo it away, but an ally is an ally. Rox gave in and let the little guy tag along. A small moment of reprieve on an otherwise difficult day."
    }
  ],
  "id": 635
}