{
  "name": "Molten Furnace",
  "level": 80,
  "story": 115,
  "goals": [
    {
      "active": "",
      "complete": ""
    },
    {
      "active": "Read the letter from Braham.",
      "complete": ""
    },
    {
      "active": "Infiltrate the Molten Alliance base.",
      "complete": "With the help of the Vigil and Order of Whispers, Braham, Rox, and I infiltrated the Molten Alliance base. The things they\u0027re doing down there, the weapons that the Alliance is building..."
    },
    {
      "active": "Proceed through the Molten Alliance base.",
      "complete": "We fought our way to the weapons-testing facility first. They tried to trap us inside of the main arena, subjecting us to their \"games.\" Flaming walls, traps, explosions—to think that they made some of the prisoners endure those tests. Well, there\u0027s not much left of the lab anymore. Kostya, one of the Alliance\u0027s leading scientists, tried to stop us, but I don\u0027t think anyone was in the mood to talk things out."
    },
    {
      "active": "Travel deeper into the Molten Alliance base.",
      "complete": "After destroying their weapons-testing area, we made our way deeper into the mine. We encountered a few survivors along the way. Braham... I could tell that his stress was building. Finding some of his friends from Cragstead gave him a flicker of hope, but there were still more prisoners deeper in the mine. The smell of burnt flesh didn\u0027t instill a ton of confidence."
    },
    {
      "active": "Find an escape route from the base.",
      "complete": "As we made our way into the heart of the base, we found some sort of weapon fixed in the center of the main chamber. The size of that thing...it was enormous. We didn\u0027t have a lot of time to inspect the device before we were ambushed by two more Molten Alliance warriors: Rodion and Gigarg.\n\nThey looked like they were dropped straight out of the test lab. Blue flame pulsed through Rodion\u0027s veins—I\u0027ve never seen a charr that big. Gigarg\u0027s armor was just as impressive. There was something eerie about them. Their size, their strength... There\u0027s nothing natural about it. We took them down, but we almost went down with them.\n\nAfter the fight, Braham and I planted bombs along the base of the mystery weapon while Rox secured our exit. Rox was reluctant to handle explosives, but that\u0027s a story for less dire circumstances. We escaped by the skin of our teeth, but at least we left behind a mess. Whatever that weapon was, I hope it stays buried along with the rest of the facility.\n\nThe Molten Alliance is done. At least for now."
    }
  ],
  "id": 641
}