{
  "name": "Hard Boiled",
  "level": 80,
  "story": 116,
  "goals": [
    {
      "active": "Leave the area to plan your next move.",
      "complete": ""
    },
    {
      "active": "Read the letter from E.",
      "complete": ""
    },
    {
      "active": "The Dead End",
      "complete": "Another letter from E today. Captain Theo Ashford succumbed to his wounds after the attack on Dragon Bash... The festivities are ongoing, so the Lionguard are desperate to keep this investigation under wraps. E recommended that I stop by the Dead End Bar in Divinity\u0027s Reach to meet with Detective Marjory Delaqua. Never heard of her, but E\u0027s intel is good. I headed her way.\n\nI ran into Logan Thackeray inside the tavern; he was already speaking with Marjory about the case. She was accompanied by Lady Kasmeer Meade, Marjory\u0027s assistant (much to Logan\u0027s surprise). Ashford\u0027s family is looking into the incident, and they\u0027re afraid the Lionguard is too busy keeping things quiet to get any meaningful work done. Marjory and Kasmeer agreed to help."
    },
    {
      "active": "The Scene of the Crime",
      "complete": "After regrouping with Ellen Kiel at the crime scene, Marjory lent me a device that detects energy fluctuations: she called it the Tassi box. Anything that came into contact with the arcane residue left behind from the attack should glow after being scanned, helping us find our culprit. While testing the device, we caught a trace of residue on one of the medics—a woman named Mai Trin. That turned out to be a false positive, though, as she\u0027d been in contact with the wounded while tending to their injuries."
    },
    {
      "active": "Leave the area to plan your next move.",
      "complete": ""
    },
    {
      "active": "Read the letter from Marjory Delaqua.",
      "complete": ""
    },
    {
      "active": "Every Piece Matters",
      "complete": ""
    },
    {
      "active": "Every Piece Matters",
      "complete": ""
    },
    {
      "active": "Every Piece Matters",
      "complete": "Some of the cultural representatives fled the scene following the attack. Since they\u0027d each approached the effigy to deliver their offerings, Marjory considers them all suspects. The Lionguard were able to track three of the five, so Marjory tasked me with bringing them back to Lion\u0027s Arch for questioning.\n\nI spoke with Morraloo, the quaggan suspect, in Bloodtide Coast. They claimed that someone threatened them, threatened their tadpoles. The skritt suspect, Kasparak, was even less help. Whoever is behind this mess bribed her with something \"shiny,\" which wasn\u0027t all that surprising. At the very least, I convinced both to return to the crime scene to share their stories with Marjory and Kiel. The third suspect was already dead by the time I arrived; throat cut from ear to ear, tossed away in a cave south of Lion\u0027s Arch."
    },
    {
      "active": "Read the letter from Marjory Delaqua.",
      "complete": ""
    },
    {
      "active": "Every Piece Matters",
      "complete": ""
    },
    {
      "active": "Every Piece Matters",
      "complete": "The Lionguard were able to track down the final two suspects in the nick of time, so I headed their way. Astorra was tucked away in Caledon Forest and was immediately defensive of her actions. She quickly surrendered her side of the tale, citing manipulation. I didn\u0027t get the impression that she was responsible, but...naive.\n\nTrembling Song was the most helpful (and seemed at least somewhat remorseful). She was quick to share, sparing no detail, which shed light on the others\u0027 stories. During her journey to Lion\u0027s Arch, she was beckoned to join a group of travelers and sit by their fire. She believes that while she slept, they tampered with her offering to the effigy. Much like the other suspects, whatever was added to their offerings may have caused the chemical reaction that triggered the explosion.\n\nWith the suspects headed to Lion\u0027s Arch, we\u0027re one step closer to the truth."
    }
  ],
  "id": 644
}