{
  "name": "The Aetherblade Retreat",
  "level": 80,
  "story": 116,
  "goals": [
    {
      "active": "",
      "complete": ""
    },
    {
      "active": "Read the letter from Inspector Kiel.",
      "complete": "Turns out they were hiding in Lion\u0027s Arch all along, tucked away in a cave southwest of the city. Looks like Kiel and I know where we\u0027re headed next."
    },
    {
      "active": "Battle through the Aetherblade barracks.",
      "complete": "Kiel and I infiltrated the Aetherblade base and managed to fight our way inside. Seems the \u0027Blades are comprised of pirates and Inquest; they\u0027re rough in a fight, but also tech savvy. Their operation was impressive, especially given it was so close to the city."
    },
    {
      "active": "Shut down Frizz\u0027s Lab.",
      "complete": "The base was riddled with traps and lasers, making it difficult to navigate. Kiel and I found our way into a lab run by an asura named Frizz. Unbelievable that a bunch of pirates managed to erect an entire Inquest laboratory inside of the cave, filled with strange technologies. It looked like they were tracing something, though it\u0027ll be hard to question Frizz about his findings now. He was...squashed during the encounter."
    },
    {
      "active": "Keep exploring the Aetherblade hideout.",
      "complete": "The main hub of their hideout was constructed from the remnants of beached ships. And the stormy alcove was filled with pirates and Inquest engineers; crates upon crates were stacked against the walls. Mai Trin and her First Mate, Horrik, were hiding in the center of the maze, waiting for us to arrive."
    },
    {
      "active": "The Aetherblade Retreat",
      "complete": "They gave us their best fight, but we were able to take them both down. Horrik didn\u0027t make it out alive, but Mai Trin wisely surrendered to Kiel before we diced her into skritt feed.\n\nWith Mai Trin in custody, maybe we\u0027ll figure out who\u0027s behind this whole mess."
    }
  ],
  "id": 646
}