{
  "name": "The Queen\u0027s Address",
  "level": 80,
  "story": 117,
  "goals": [
    {
      "active": "Leave the area to plan your next move.",
      "complete": ""
    },
    {
      "active": "",
      "complete": ""
    },
    {
      "active": "Read the official letter.",
      "complete": ""
    },
    {
      "active": "The Closing Ceremony",
      "complete": "A few days later, I attended the closing ceremony for the Queen\u0027s Jubilee with Rox and Braham—as promised, the festivities continued despite the attack. Unfortunately, the city\u0027s blissful ignorance was cut short when the hooded figure revealed herself during Jennah\u0027s concluding speech. Scarlet Briar is her name, and I have a sneaking suspicion she has something to do with Tyria\u0027s recent misfortunes.\n\nScarlet wrested control of the watchknights, employing them as her muscle in a hostile takeover of the jubilee. She then fired her rifle at Queen Jennah\u0027s dais and detonated a bomb, causing it to collapse. Lord Faren was able to grab hold of the queen, but she shattered in his arms—a mesmer illusion. Faren fell to an uncertain fate, unable to maintain his balance.\n\nTo complicate matters, Scarlet planted bombs throughout the Pavilion\u0027s courtyard, sending the city into pandemonium. We were able to disarm most of them, but the causalities were significant. All the while Scarlet continued to mock the panicked civilians, claiming that this is \"bigger than them.\"\n \nWe regrouped with the real queen (safe and unharmed), along with Countess Anise and Logan. While Anise and Logan were at odds about their preparedness for the situation, Rox announced that the asuran cultural representative, Vorpp, might have some useful teleportation technology that could help us breach the Pavilion and confront Scarlet. Vorpp immediately agreed to help, claiming that Scarlet had previously made her way through the asuran colleges and was a blister he wouldn\u0027t mind popping."
    }
  ],
  "id": 651
}