{
  "name": "Scarlet\u0027s End",
  "level": 80,
  "story": 119,
  "goals": [
    {
      "active": "End of the Line",
      "complete": "This was it—the final push. Braham would claim glory for his legend, Rox would earn a place in the Stone warband, and Marjory and Kasmeer would exact justice for the whole of Kryta. We found Scarlet Briar wounded in front of a central control console for the entire operation. She ranted and raved at us, mocking our heroics and gloating about what was to come: that Tyria would serve a new master. Marjory and Braham moved in to apprehend her, but the crafty engineer still had one last trick up her sleeve. \n\nMarjory and Braham took the brunt of Scarlet\u0027s trap, getting thrown back by a concussive force and lightning. Rox ordered Braham to stay put as she treated his broken leg, refusing to leave his side. Marjory appeared far worse off. She was lying on the floor motionless, bruised, and burned. Kasmeer tried to wake her, but there was no response. The mesmer\u0027s expression darkened and she rose to her feet, staff trembling in hand. Enraged, she cried out and sprinted back toward the fight.  \n\nScarlet was ready with a stockpile of grenades, but it couldn\u0027t hold the two of us at bay for long. She became distracted by Kasmeer\u0027s illusions just long enough for the opening I needed to deal a fatal blow. With her last words, Scarlet said her death wouldn\u0027t save us. I glanced at the main screen of the console behind her. We were too late; the drill was about to breach its intended target, the ley-line hub beneath Lion\u0027s Arch. Kasmeer had returned to Marjory who, despite Rox\u0027s efforts, was still unresponsive. Cradled in Kasmeer\u0027s arms, the detective slowly stirred awake. The two embraced and shared a touching moment. Seconds later, the Breachmaker shook as a blinding column of light shot up into the center of the fortress. As the shaking grew in intensity, we hurried our injured friends back through the portal and down to the city. The Breachmaker collapsed shortly after, debris crashing below and littering the whole of Lion\u0027s Arch."
    }
  ],
  "id": 662
}