{
  "name": "Connecting the Pieces",
  "level": 80,
  "story": 119,
  "goals": [
    {
      "active": "Leave the area to plan your next move.",
      "complete": ""
    },
    {
      "active": "Read the letter.",
      "complete": "Soon after, I received a missive from Steward Gixx of the Durmand Priory. He disclosed the location of a recently discovered lair belonging to—you guessed it—one Scarlet Briar in the caves below the Priory itself. Lucky for me, Gixx offered me a first crack at investigating the place.\n\n***"
    },
    {
      "active": "Scarlet\u0027s Secret Lair",
      "complete": "At first glance, Scarlet\u0027s lair appeared to be nothing more than a candlelit hideout with simple furniture and papers scattered about. After a bit of digging through her notes, I uncovered the passcode for the magitech console in the corner. Once accessed, the console projected a series of moving images and maps that I surmised would help uncover Scarlet\u0027s next big move. As I puzzled over the images, my eyes were drawn to a crude and unsettling painting of a large beast on the ceiling. Was this creature some new obsession of hers? A nightmare?\n\n***"
    },
    {
      "active": "Leave the area to plan your next move.",
      "complete": ""
    },
    {
      "active": "Read the letter.",
      "complete": ""
    },
    {
      "active": "Regrouping",
      "complete": "By the time I regrouped with my friends in Lion\u0027s Arch, they\u0027d put down Scarlet\u0027s marionette for good and were taking some personal time. Rytlock Brimstone had tracked down Rox to give her a new assignment after some business taking down the dragon lieutenant Tequatl and acquiring a rotting tail trophy as proof. She was ordered to kill Scarlet Briar as her final test to secure a spot in Rytlock\u0027s Stone warband. Braham seemed upset by the news; I think he\u0027s worried he\u0027ll lose his new friend.  \n\nLogan Thackeray was there, too, with Taimi and her golem still in tow. The progeny made an optimistic attempt at playacting her way into Braham\u0027s charge, which worked. Taimi brought up the probing devices again; she suspected that Scarlet\u0027s plans were somehow tied to the Elder Dragons. I thought back to the painting in Scarlet\u0027s lair. Was the progeny right?  After, I overheard Kasmeer confide in Marjory about a family matter. Today was the anniversary of her father\u0027s death. Kasmeer\u0027s brother gambled away more than he could pay, which led to her father\u0027s imprisonment and demise. Her family had lost everything: titles, home, every possession. She was deeply upset, but Marjory offered her a place to stay.\n\n***"
    },
    {
      "active": "Leave the area to plan your next move.",
      "complete": ""
    },
    {
      "active": "Read the letter.",
      "complete": ""
    },
    {
      "active": "Aether Escape",
      "complete": "More bad news wasn\u0027t far behind. I received a note from Captain Ellen Kiel and rushed over to Fort Marriner. With lightning precision, the Aetherblades had attacked the fort and freed Captain Mai Trin from the stockade. After mopping up the leftover pirates, Captain Kiel and I spoke with the sheriff. From the sound of it, Braham and Taimi got wrapped up in the mess and gave chase as the Aetherblades fled through a portal into the Mists.\n\n***"
    },
    {
      "active": "The Edge of the Mists",
      "complete": "I caught up with Braham and Taimi in the Edge of the Mists, a series of fringe islands floating between Tyria and whatever lies beyond. Mai Trin and her Aetherblades were long gone. Taimi\u0027s golem, Scruffy, had been damaged while investigating one of Scarlet\u0027s probe devices and was undergoing repairs, stranding her for the time being. Braham kept watch over the progeny, trading stories and banter. Looking to kill some time, I got to know the \"prodigy progeny\" a little better, and her thoughts about Scarlet. She suspects Scarlet\u0027s probes were made to search for Tyria\u0027s ley lines, some kind of pattern of magical currents spanning the world.\n\n***"
    },
    {
      "active": "",
      "complete": ""
    },
    {
      "active": "Read the letter.",
      "complete": ""
    },
    {
      "active": "A Study in Scarlet",
      "complete": "After returning from the Mists, Marjory requested my presence at the Dead End Bar to help figure out Scarlet\u0027s endgame. With some help from Emissary Vorpp, we pored over the evidence.\n\nScarlet—Ceara back then—had studied at all three asura colleges and attracted the attention of Omadd, who wanted to understand the very nature of the Eternal Alchemy. Omadd took Ceara on as an assistant and eventually experimented on her with a special mind-isolating machine. As her mind was exposed to Tyria\u0027s magical network, she encountered something that drove her mad. Sporting a new name, Scarlet went on to make friends and allies of various outcast factions across Tyria, pairing them together for their mutual benefit, but also her own. These groups began to terrorize the lands from Ascalon to Kryta all while she set up her probes, virtually unnoticed. She used intel about ley lines gathered from her studies in Rata Sum and her time in the Inquest to narrow her list of targets. Her tampering with the watchknights allowed her the chance to bolster her ranks and reverse engineer and modify future versions. Finally, Scarlet\u0027s ploy to install Captain Mai Trin on the Captain\u0027s Council in Lion\u0027s Arch was attempted to weaken the city\u0027s defenses and leadership from the inside. Mai Trin ultimately failed, but with the rest of the evidence taken into consideration—Scarlet\u0027s gathering armies, airships, and equipment; probes searching for ley lines; assassinations—we came to an alarming conclusion: Scarlet Briar\u0027s next target was Lion\u0027s Arch."
    }
  ],
  "id": 663
}