{
  "name": "Deep Trouble",
  "level": 80,
  "story": 121,
  "goals": [
    {
      "active": "",
      "complete": ""
    },
    {
      "active": "Investigate the depths of the mine.",
      "complete": "I regrouped with Gorrik, Rama, and Yao near the bottom of the mine at Luxon Terminus. The group was getting increasingly testy with each other. Not sure if it was the stress or some side effect of haze exposure, or what...\n\nWe hit a dead end, but Yao had a clever solution using their mech, Finn. They reprogrammed Finn\u0027s drone to scan for weaknesses in the cavern wall and plant charges. With a warning from Gorrik about haze levels likely increasing as we descend, we blasted the wall open and continued deeper into the mine. We were immediately ambushed by subterranean horrors.\n\nAs we fought our way through a series of demon attacks, Gorrik asked me about the other voices I\u0027d heard over comms. I wasn\u0027t sure if they were real or how to respond if they were. So I didn\u0027t.\n\nI saw a glow at the end of a tunnel, but as I walked forward to get a better look, I felt as though I\u0027d been punched in the stomach, the breath stolen from my lungs. As I regained my composure, we realized that the glow ahead came from a ley line!\n\nThe nearby jade glimmered with infused energy, though Gorrik said it also seemed to give off a \"miasmic byproduct.\" He and Yao theorized that perhaps this was the cause of the Brotherhood infighting that had been plaguing the mining effort. We moved through the cavern, inspecting more of the nearby jade.\n\nWe zip-lined across a chasm to a large rock formation—and that\u0027s when my memory gets hazy. A creature—some kind of shape-shifting demon—attacked us. Physically, yes, but it also assaulted me mentally somehow. Gorrik, Rama, Yao...they disappeared from my vision only to be replaced by...departed friends. Almorra and others...under attack. Their twisted words stabbed at me while waves of shadowy beasts pressed in, the wounds raw as though their deaths were fresh—deaths on my hands. The demon\u0027s power crushing my mind, I couldn\u0027t think, could only feel...\n\nI swore we\u0027d beaten it, but I lost consciousness. I heard my friends yelling to retreat, the demon healing itself as though we hadn\u0027t landed a single blow. They dragged me to safety.\n\nI woke outside the mine with Gorrik, Rama, and Yao hovering over me in concern, my head finally clearing, the feeling of mental vulnerability wearing off. As best I can piece together from my experience and Gorrik\u0027s theorizing, the demon had invaded my memories, latching on to the rawest emotions it could find. It used hallucinations in combination with the haze-induced vulnerability to overwhelm me. And while feeding on the ley line, the thing cannot be stopped.\n\nIf we can somehow defeat the demon, Gyala Delve\u0027s ley line and jade resources could be a solution to Cantha\u0027s dwindling energy supply. How we do that with an unkillable demonic entity staking its claim on the ley line is anybody\u0027s guess.\n\nI\u0027m anxious to hear what Gorrik and Taimi are planning. Seems likely to involve reopening old wounds, but some scars are better left to heal."
    }
  ],
  "id": 669
}