{
  "name": "A Raw Deal",
  "level": 80,
  "story": 121,
  "goals": [
    {
      "active": "",
      "complete": ""
    },
    {
      "active": "Read the message from Rama.",
      "complete": ""
    },
    {
      "active": "Attend Rama\u0027s party.",
      "complete": "I\u0027d been laying low in an attempt to recuperate—physically and mentally—from...everything. It\u0027s been difficult to wrap my mind around the fact that the dragon cycle is finished. Years of war finally at an end... I\u0027ve been too tired to clearly think it all through, too tired to even celebrate much since seeing everyone at Kas and Jory\u0027s engagement party. Maybe it\u0027s because the cycle\u0027s end doesn\u0027t mean there aren\u0027t plenty of problems to solve and battles to fight—Cantha\u0027s dwindling energy resources being one of many in this region alone. Not to mention a host of ongoing conflicts back in central Tyria and Elona.\n\nI needed to take my mind off it all. Recharge. So despite still feeling exhausted, I accepted an invitation to the Red Duck Tea House for a party hosted by the recently retired Detective Rama. \n\nGorrik and I ended up being Rama\u0027s only guests. Three people, all that food...and Rama doesn\u0027t even eat sushi!\n\nWe chatted a bit, though Rama was preoccupied with one eye on the door—hoping for the arrival of an important guest, it seemed—and Gorrik was working on a mouthful of sushi just as Taimi called with some intriguing information.\n\nJoon\u0027s protégé Yao uncovered that the Jade Brotherhood had discovered a form of high-powered jade during their mining operation in Gyala Depths in the Jade Sea. And the Brotherhood\u0027s leader, Park Chul-Moo, apparently informed Yao that some miners were missing while others were acting strangely aggressive.\n\nThe second he heard about missing persons and strange happenings, Gorrik excitedly went on the offensive, shooting down excuse after feeble excuse from Rama—this was going to be the first case for the Friends Detective Agency! The paperwork was already done, \"terrible name\" notwithstanding, and Gorrik was determined to turn the fledging agency into a full-blown operation.\n\nNext thing we knew, Rama\u0027s party—and his retirement—were over, and we were on our way to investigate the Jade Brotherhood mining operation at Gyala Delve."
    }
  ],
  "id": 674
}